Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32U5Gx_rcc equates.
 */

#pragma once

#include    <stdint.h>

// RCC address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    ICSCR1;
    volatile    uint32_t    ICSCR2;
    volatile    uint32_t    ICSCR3;
    volatile    uint32_t    CRRCR;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    CFGR1;
    volatile    uint32_t    CFGR2;
    volatile    uint32_t    CFGR3;
    volatile    uint32_t    PLL1CFGR;
    volatile    uint32_t    PLL2CFGR;
    volatile    uint32_t    PLL3CFGR;
    volatile    uint32_t    PLL1DIVR;
    volatile    uint32_t    PLL1FRACR;
    volatile    uint32_t    PLL2DIVR;
    volatile    uint32_t    PLL2FRACR;
    volatile    uint32_t    PLL3DIVR;
    volatile    uint32_t    PLL3FRACR;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    CIER;
    volatile    uint32_t    CIFR;
    volatile    uint32_t    CICR;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    AHB1RSTR;
    volatile    uint32_t    AHB2RSTR1;
    volatile    uint32_t    AHB2RSTR2;
    volatile    uint32_t    AHB3RSTR;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    APB1RSTR1;
    volatile    uint32_t    APB1RSTR2;
    volatile    uint32_t    APB2RSTR;
    volatile    uint32_t    APB3RSTR;
    volatile    uint32_t    RESERVED5;
    volatile    uint32_t    AHB1ENR;
    volatile    uint32_t    AHB2ENR1;
    volatile    uint32_t    AHB2ENR2;
    volatile    uint32_t    AHB3ENR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    APB1ENR1;
    volatile    uint32_t    APB1ENR2;
    volatile    uint32_t    APB2ENR;
    volatile    uint32_t    APB3ENR;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    AHB1SMENR;
    volatile    uint32_t    AHB2SMENR1;
    volatile    uint32_t    AHB2SMENR2;
    volatile    uint32_t    AHB3SMENR;
    volatile    uint32_t    RESERVED8;
    volatile    uint32_t    APB1SMENR1;
    volatile    uint32_t    APB1SMENR2;
    volatile    uint32_t    APB2SMENR;
    volatile    uint32_t    APB3SMENR;
    volatile    uint32_t    RESERVED9;
    volatile    uint32_t    SRDAMR;
    volatile    uint32_t    RESERVED10;
    volatile    uint32_t    CCIPR1;
    volatile    uint32_t    CCIPR2;
    volatile    uint32_t    CCIPR3;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    BDCR;
    volatile    uint32_t    CSR;
    volatile    uint32_t    RESERVED12[6];
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    PRIVCFGR;
} RCC_TypeDef;

#ifdef __cplusplus
#define RCC_NS  reinterpret_cast<RCC_TypeDef *>(0x46020C00U)
#define RCC_S   reinterpret_cast<RCC_TypeDef *>(0x56020C00U)

#else
#define RCC_NS  ((RCC_TypeDef *)0x46020C00U)
#define RCC_S   ((RCC_TypeDef *)0x56020C00U)
#endif

// CR Configuration

#define RCC_CR_PLL3RDY                      (0x1U<<29U)
#define RCC_CR_PLL3ON                       (0x1U<<28U)
#define RCC_CR_PLL2RDY                      (0x1U<<27U)
#define RCC_CR_PLL2ON                       (0x1U<<26U)
#define RCC_CR_PLL1RDY                      (0x1U<<25U)
#define RCC_CR_PLL1ON                       (0x1U<<24U)
#define RCC_CR_HSEEXT                       (0x1U<<20U)
#define RCC_CR_CSSON                        (0x1U<<19U)
#define RCC_CR_HSEBYP                       (0x1U<<18U)
#define RCC_CR_HSERDY                       (0x1U<<17U)
#define RCC_CR_HSEON                        (0x1U<<16U)
#define RCC_CR_SHSIRDY                      (0x1U<<15U)
#define RCC_CR_SHSION                       (0x1U<<14U)
#define RCC_CR_HSI48RDY                     (0x1U<<13U)
#define RCC_CR_HSI48ON                      (0x1U<<12U)
#define RCC_CR_HSIRDY                       (0x1U<<10U)
#define RCC_CR_HSIKERON                     (0x1U<<9U)
#define RCC_CR_HSION                        (0x1U<<8U)
#define RCC_CR_MSIPLLFAST                   (0x1U<<7U)
#define RCC_CR_MSIPLLSEL                    (0x1U<<6U)
#define RCC_CR_MSIKRDY                      (0x1U<<5U)
#define RCC_CR_MSIKON                       (0x1U<<4U)
#define RCC_CR_MSIPLLEN                     (0x1U<<3U)
#define RCC_CR_MSISRDY                      (0x1U<<2U)
#define RCC_CR_MSIKERON                     (0x1U<<1U)
#define RCC_CR_MSISON                       (0x1U<<0U)
#define RCC_CR_PLL3RDY_B_0X0                (0x0U<<29U)
#define RCC_CR_PLL3RDY_B_0X1                (0x1U<<29U)
#define RCC_CR_PLL3ON_B_0X0                 (0x0U<<28U)
#define RCC_CR_PLL3ON_B_0X1                 (0x1U<<28U)
#define RCC_CR_PLL2RDY_B_0X0                (0x0U<<27U)
#define RCC_CR_PLL2RDY_B_0X1                (0x1U<<27U)
#define RCC_CR_PLL2ON_B_0X0                 (0x0U<<26U)
#define RCC_CR_PLL2ON_B_0X1                 (0x1U<<26U)
#define RCC_CR_PLL1RDY_B_0X0                (0x0U<<25U)
#define RCC_CR_PLL1RDY_B_0X1                (0x1U<<25U)
#define RCC_CR_PLL1ON_B_0X0                 (0x0U<<24U)
#define RCC_CR_PLL1ON_B_0X1                 (0x1U<<24U)
#define RCC_CR_HSEEXT_B_0X0                 (0x0U<<20U)
#define RCC_CR_HSEEXT_B_0X1                 (0x1U<<20U)
#define RCC_CR_CSSON_B_0X0                  (0x0U<<19U)
#define RCC_CR_CSSON_B_0X1                  (0x1U<<19U)
#define RCC_CR_HSEBYP_B_0X0                 (0x0U<<18U)
#define RCC_CR_HSEBYP_B_0X1                 (0x1U<<18U)
#define RCC_CR_HSERDY_B_0X0                 (0x0U<<17U)
#define RCC_CR_HSERDY_B_0X1                 (0x1U<<17U)
#define RCC_CR_HSEON_B_0X0                  (0x0U<<16U)
#define RCC_CR_HSEON_B_0X1                  (0x1U<<16U)
#define RCC_CR_SHSIRDY_B_0X0                (0x0U<<15U)
#define RCC_CR_SHSIRDY_B_0X1                (0x1U<<15U)
#define RCC_CR_SHSION_B_0X0                 (0x0U<<14U)
#define RCC_CR_SHSION_B_0X1                 (0x1U<<14U)
#define RCC_CR_HSI48RDY_B_0X0               (0x0U<<13U)
#define RCC_CR_HSI48RDY_B_0X1               (0x1U<<13U)
#define RCC_CR_HSI48ON_B_0X0                (0x0U<<12U)
#define RCC_CR_HSI48ON_B_0X1                (0x1U<<12U)
#define RCC_CR_HSIRDY_B_0X0                 (0x0U<<10U)
#define RCC_CR_HSIRDY_B_0X1                 (0x1U<<10U)
#define RCC_CR_HSIKERON_B_0X0               (0x0U<<9U)
#define RCC_CR_HSIKERON_B_0X1               (0x1U<<9U)
#define RCC_CR_HSION_B_0X0                  (0x0U<<8U)
#define RCC_CR_HSION_B_0X1                  (0x1U<<8U)
#define RCC_CR_MSIPLLFAST_B_0X0             (0x0U<<7U)
#define RCC_CR_MSIPLLFAST_B_0X1             (0x1U<<7U)
#define RCC_CR_MSIPLLSEL_B_0X0              (0x0U<<6U)
#define RCC_CR_MSIPLLSEL_B_0X1              (0x1U<<6U)
#define RCC_CR_MSIKRDY_B_0X0                (0x0U<<5U)
#define RCC_CR_MSIKRDY_B_0X1                (0x1U<<5U)
#define RCC_CR_MSIKON_B_0X0                 (0x0U<<4U)
#define RCC_CR_MSIKON_B_0X1                 (0x1U<<4U)
#define RCC_CR_MSIPLLEN_B_0X0               (0x0U<<3U)
#define RCC_CR_MSIPLLEN_B_0X1               (0x1U<<3U)
#define RCC_CR_MSISRDY_B_0X0                (0x0U<<2U)
#define RCC_CR_MSISRDY_B_0X1                (0x1U<<2U)
#define RCC_CR_MSIKERON_B_0X0               (0x0U<<1U)
#define RCC_CR_MSIKERON_B_0X1               (0x1U<<1U)
#define RCC_CR_MSISON_B_0X0                 (0x0U<<0U)
#define RCC_CR_MSISON_B_0X1                 (0x1U<<0U)

