Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
// ICSCR1 Configuration

#define RCC_ICSCR1_MSISRANGE                (0xFU<<28U)
#define RCC_ICSCR1_MSISRANGE_0              (0x1U<<28U)
#define RCC_ICSCR1_MSIKRANGE                (0xFU<<24U)
#define RCC_ICSCR1_MSIKRANGE_0              (0x1U<<24U)
#define RCC_ICSCR1_MSIRGSEL                 (0x1U<<23U)
#define RCC_ICSCR1_MSIBIAS                  (0x1U<<22U)
#define RCC_ICSCR1_MSICAL0                  (0x1FU<<15U)
#define RCC_ICSCR1_MSICAL0_0                (0x1U<<15U)
#define RCC_ICSCR1_MSICAL1                  (0x1FU<<10U)
#define RCC_ICSCR1_MSICAL1_0                (0x1U<<10U)
#define RCC_ICSCR1_MSICAL2                  (0x1FU<<5U)
#define RCC_ICSCR1_MSICAL2_0                (0x1U<<5U)
#define RCC_ICSCR1_MSICAL3                  (0x1FU<<0U)
#define RCC_ICSCR1_MSICAL3_0                (0x1U<<0U)
#define RCC_ICSCR1_MSISRANGE_B_0X0          (0x0U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X1          (0x1U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X2          (0x2U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X3          (0x3U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X4          (0x4U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X5          (0x5U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X6          (0x6U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X7          (0x7U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X8          (0x8U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0X9          (0x9U<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0XA          (0xAU<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0XB          (0xBU<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0XC          (0xCU<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0XD          (0xDU<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0XE          (0xEU<<28U)
#define RCC_ICSCR1_MSISRANGE_B_0XF          (0xFU<<28U)
#define RCC_ICSCR1_MSIKRANGE_B_0X0          (0x0U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X1          (0x1U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X2          (0x2U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X3          (0x3U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X4          (0x4U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X5          (0x5U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X6          (0x6U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X7          (0x7U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X8          (0x8U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0X9          (0x9U<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0XA          (0xAU<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0XB          (0xBU<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0XC          (0xCU<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0XD          (0xDU<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0XE          (0xEU<<24U)
#define RCC_ICSCR1_MSIKRANGE_B_0XF          (0xFU<<24U)
#define RCC_ICSCR1_MSIRGSEL_B_0X0           (0x0U<<23U)
#define RCC_ICSCR1_MSIRGSEL_B_0X1           (0x1U<<23U)
#define RCC_ICSCR1_MSIBIAS_B_0X0            (0x0U<<22U)
#define RCC_ICSCR1_MSIBIAS_B_0X1            (0x1U<<22U)

// ICSCR2 Configuration

#define RCC_ICSCR2_MSITRIM0                 (0x1FU<<15U)
#define RCC_ICSCR2_MSITRIM0_0               (0x1U<<15U)
#define RCC_ICSCR2_MSITRIM1                 (0x1FU<<10U)
#define RCC_ICSCR2_MSITRIM1_0               (0x1U<<10U)
#define RCC_ICSCR2_MSITRIM2                 (0x1FU<<5U)
#define RCC_ICSCR2_MSITRIM2_0               (0x1U<<5U)
#define RCC_ICSCR2_MSITRIM3                 (0x1FU<<0U)
#define RCC_ICSCR2_MSITRIM3_0               (0x1U<<0U)

// ICSCR3 Configuration

#define RCC_ICSCR3_HSITRIM                  (0x1FU<<16U)
#define RCC_ICSCR3_HSITRIM_0                (0x1U<<16U)
#define RCC_ICSCR3_HSICAL                   (0xFFFU<<0U)
#define RCC_ICSCR3_HSICAL_0                 (0x1U<<0U)

// CRRCR Configuration

#define RCC_CRRCR_HSI48CAL                  (0x1FFU<<0U)
#define RCC_CRRCR_HSI48CAL_0                (0x1U<<0U)

// CFGR1 Configuration

#define RCC_CFGR1_MCOPRE                    (0x7U<<28U)
#define RCC_CFGR1_MCOPRE_0                  (0x1U<<28U)
#define RCC_CFGR1_MCOSEL                    (0xFU<<24U)
#define RCC_CFGR1_MCOSEL_0                  (0x1U<<24U)
#define RCC_CFGR1_STOPKERWUCK               (0x1U<<5U)
#define RCC_CFGR1_STOPWUCK                  (0x1U<<4U)
#define RCC_CFGR1_SWS                       (0x3U<<2U)
#define RCC_CFGR1_SWS_0                     (0x1U<<2U)
#define RCC_CFGR1_SW                        (0x3U<<0U)
#define RCC_CFGR1_SW_0                      (0x1U<<0U)
#define RCC_CFGR1_MCOPRE_B_0X0              (0x0U<<28U)
#define RCC_CFGR1_MCOPRE_B_0X1              (0x1U<<28U)
#define RCC_CFGR1_MCOPRE_B_0X2              (0x2U<<28U)
#define RCC_CFGR1_MCOPRE_B_0X3              (0x3U<<28U)
#define RCC_CFGR1_MCOPRE_B_0X4              (0x4U<<28U)
#define RCC_CFGR1_MCOSEL_B_0X0              (0x0U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X1              (0x1U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X2              (0x2U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X3              (0x3U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X4              (0x4U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X5              (0x5U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X6              (0x6U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X7              (0x7U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X8              (0x8U<<24U)
#define RCC_CFGR1_MCOSEL_B_0X9              (0x9U<<24U)
#define RCC_CFGR1_STOPKERWUCK_B_0X0         (0x0U<<5U)
#define RCC_CFGR1_STOPKERWUCK_B_0X1         (0x1U<<5U)
#define RCC_CFGR1_STOPWUCK_B_0X0            (0x0U<<4U)
#define RCC_CFGR1_STOPWUCK_B_0X1            (0x1U<<4U)
#define RCC_CFGR1_SWS_B_0X0                 (0x0U<<2U)
#define RCC_CFGR1_SWS_B_0X1                 (0x1U<<2U)
#define RCC_CFGR1_SWS_B_0X2                 (0x2U<<2U)
#define RCC_CFGR1_SWS_B_0X3                 (0x3U<<2U)
#define RCC_CFGR1_SW_B_0X0                  (0x0U<<0U)
#define RCC_CFGR1_SW_B_0X1                  (0x1U<<0U)
#define RCC_CFGR1_SW_B_0X2                  (0x2U<<0U)
#define RCC_CFGR1_SW_B_0X3                  (0x3U<<0U)

// CFGR2 Configuration

#define RCC_CFGR2_APB2DIS                   (0x1U<<20U)
#define RCC_CFGR2_APB1DIS                   (0x1U<<19U)
#define RCC_CFGR2_AHB2DIS2                  (0x1U<<18U)
#define RCC_CFGR2_AHB2DIS1                  (0x1U<<17U)
#define RCC_CFGR2_AHB1DIS                   (0x1U<<16U)
#define RCC_CFGR2_DPRE                      (0x7U<<12U)
#define RCC_CFGR2_DPRE_0                    (0x1U<<12U)
#define RCC_CFGR2_PPRE2                     (0x7U<<8U)
#define RCC_CFGR2_PPRE2_0                   (0x1U<<8U)
#define RCC_CFGR2_PPRE1                     (0x7U<<4U)
#define RCC_CFGR2_PPRE1_0                   (0x1U<<4U)
#define RCC_CFGR2_HPRE                      (0xFU<<0U)
#define RCC_CFGR2_HPRE_0                    (0x1U<<0U)
#define RCC_CFGR2_APB2DIS_B_0X0             (0x0U<<20U)
#define RCC_CFGR2_APB2DIS_B_0X1             (0x1U<<20U)
#define RCC_CFGR2_APB1DIS_B_0X0             (0x0U<<19U)
#define RCC_CFGR2_APB1DIS_B_0X1             (0x1U<<19U)
#define RCC_CFGR2_AHB2DIS2_B_0X0            (0x0U<<18U)
#define RCC_CFGR2_AHB2DIS2_B_0X1            (0x1U<<18U)
#define RCC_CFGR2_AHB2DIS1_B_0X0            (0x0U<<17U)
#define RCC_CFGR2_AHB2DIS1_B_0X1            (0x1U<<17U)
#define RCC_CFGR2_AHB1DIS_B_0X0             (0x0U<<16U)
#define RCC_CFGR2_AHB1DIS_B_0X1             (0x1U<<16U)
#define RCC_CFGR2_DPRE_B_0X4                (0x4U<<12U)
#define RCC_CFGR2_DPRE_B_0X5                (0x5U<<12U)
#define RCC_CFGR2_DPRE_B_0X6                (0x6U<<12U)
#define RCC_CFGR2_DPRE_B_0X7                (0x7U<<12U)
#define RCC_CFGR2_PPRE2_B_0X4               (0x4U<<8U)
#define RCC_CFGR2_PPRE2_B_0X5               (0x5U<<8U)
#define RCC_CFGR2_PPRE2_B_0X6               (0x6U<<8U)
#define RCC_CFGR2_PPRE2_B_0X7               (0x7U<<8U)
#define RCC_CFGR2_PPRE1_B_0X4               (0x4U<<4U)
#define RCC_CFGR2_PPRE1_B_0X5               (0x5U<<4U)
#define RCC_CFGR2_PPRE1_B_0X6               (0x6U<<4U)
#define RCC_CFGR2_PPRE1_B_0X7               (0x7U<<4U)
#define RCC_CFGR2_HPRE_B_0X8                (0x8U<<0U)
#define RCC_CFGR2_HPRE_B_0X9                (0x9U<<0U)
#define RCC_CFGR2_HPRE_B_0XA                (0xAU<<0U)
#define RCC_CFGR2_HPRE_B_0XB                (0xBU<<0U)
#define RCC_CFGR2_HPRE_B_0XC                (0xCU<<0U)
#define RCC_CFGR2_HPRE_B_0XD                (0xDU<<0U)
#define RCC_CFGR2_HPRE_B_0XE                (0xEU<<0U)
#define RCC_CFGR2_HPRE_B_0XF                (0xFU<<0U)

// CFGR3 Configuration

