Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
#define RCC_CFGR3_APB3DIS                   (0x1U<<17U)
#define RCC_CFGR3_AHB3DIS                   (0x1U<<16U)
#define RCC_CFGR3_PPRE3                     (0x7U<<4U)
#define RCC_CFGR3_PPRE3_0                   (0x1U<<4U)
#define RCC_CFGR3_APB3DIS_B_0X0             (0x0U<<17U)
#define RCC_CFGR3_APB3DIS_B_0X1             (0x1U<<17U)
#define RCC_CFGR3_AHB3DIS_B_0X0             (0x0U<<16U)
#define RCC_CFGR3_AHB3DIS_B_0X1             (0x1U<<16U)
#define RCC_CFGR3_PPRE3_B_0X4               (0x4U<<4U)
#define RCC_CFGR3_PPRE3_B_0X5               (0x5U<<4U)
#define RCC_CFGR3_PPRE3_B_0X6               (0x6U<<4U)
#define RCC_CFGR3_PPRE3_B_0X7               (0x7U<<4U)

// PLL1CFGR Configuration

#define RCC_PLL1CFGR_PLL1REN                (0x1U<<18U)
#define RCC_PLL1CFGR_PLL1QEN                (0x1U<<17U)
#define RCC_PLL1CFGR_PLL1PEN                (0x1U<<16U)
#define RCC_PLL1CFGR_PLL1MBOOST             (0xFU<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_0           (0x1U<<12U)
#define RCC_PLL1CFGR_PLL1M                  (0xFU<<8U)
#define RCC_PLL1CFGR_PLL1M_0                (0x1U<<8U)
#define RCC_PLL1CFGR_PLL1FRACEN             (0x1U<<4U)
#define RCC_PLL1CFGR_PLL1RGE                (0x3U<<2U)
#define RCC_PLL1CFGR_PLL1RGE_0              (0x1U<<2U)
#define RCC_PLL1CFGR_PLL1SRC                (0x3U<<0U)
#define RCC_PLL1CFGR_PLL1SRC_0              (0x1U<<0U)
#define RCC_PLL1CFGR_PLL1REN_B_0X0          (0x0U<<18U)
#define RCC_PLL1CFGR_PLL1REN_B_0X1          (0x1U<<18U)
#define RCC_PLL1CFGR_PLL1QEN_B_0X0          (0x0U<<17U)
#define RCC_PLL1CFGR_PLL1QEN_B_0X1          (0x1U<<17U)
#define RCC_PLL1CFGR_PLL1PEN_B_0X0          (0x0U<<16U)
#define RCC_PLL1CFGR_PLL1PEN_B_0X1          (0x1U<<16U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X0       (0x0U<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X1       (0x1U<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X2       (0x2U<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X3       (0x3U<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X4       (0x4U<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X5       (0x5U<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X6       (0x6U<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X7       (0x7U<<12U)
#define RCC_PLL1CFGR_PLL1MBOOST_B_0X8       (0x8U<<12U)
#define RCC_PLL1CFGR_PLL1M_B_0X0            (0x0U<<8U)
#define RCC_PLL1CFGR_PLL1M_B_0X1            (0x1U<<8U)
#define RCC_PLL1CFGR_PLL1M_B_0X2            (0x2U<<8U)
#define RCC_PLL1CFGR_PLL1M_B_0XF            (0xFU<<8U)
#define RCC_PLL1CFGR_PLL1RGE_B_0X3          (0x3U<<2U)
#define RCC_PLL1CFGR_PLL1SRC_B_0X0          (0x0U<<0U)
#define RCC_PLL1CFGR_PLL1SRC_B_0X1          (0x1U<<0U)
#define RCC_PLL1CFGR_PLL1SRC_B_0X2          (0x2U<<0U)
#define RCC_PLL1CFGR_PLL1SRC_B_0X3          (0x3U<<0U)

// PLL2CFGR Configuration

#define RCC_PLL2CFGR_PLL2REN                (0x1U<<18U)
#define RCC_PLL2CFGR_PLL2QEN                (0x1U<<17U)
#define RCC_PLL2CFGR_PLL2PEN                (0x1U<<16U)
#define RCC_PLL2CFGR_PLL2M                  (0xFU<<8U)
#define RCC_PLL2CFGR_PLL2M_0                (0x1U<<8U)
#define RCC_PLL2CFGR_PLL2FRACEN             (0x1U<<4U)
#define RCC_PLL2CFGR_PLL2RGE                (0x3U<<2U)
#define RCC_PLL2CFGR_PLL2RGE_0              (0x1U<<2U)
#define RCC_PLL2CFGR_PLL2SRC                (0x3U<<0U)
#define RCC_PLL2CFGR_PLL2SRC_0              (0x1U<<0U)
#define RCC_PLL2CFGR_PLL2REN_B_0X0          (0x0U<<18U)
#define RCC_PLL2CFGR_PLL2REN_B_0X1          (0x1U<<18U)
#define RCC_PLL2CFGR_PLL2QEN_B_0X0          (0x0U<<17U)
#define RCC_PLL2CFGR_PLL2QEN_B_0X1          (0x1U<<17U)
#define RCC_PLL2CFGR_PLL2PEN_B_0X0          (0x0U<<16U)
#define RCC_PLL2CFGR_PLL2PEN_B_0X1          (0x1U<<16U)
#define RCC_PLL2CFGR_PLL2M_B_0X0            (0x0U<<8U)
#define RCC_PLL2CFGR_PLL2M_B_0X1            (0x1U<<8U)
#define RCC_PLL2CFGR_PLL2M_B_0X2            (0x2U<<8U)
#define RCC_PLL2CFGR_PLL2M_B_0XF            (0xFU<<8U)
#define RCC_PLL2CFGR_PLL2RGE_B_0X3          (0x3U<<2U)
#define RCC_PLL2CFGR_PLL2SRC_B_0X0          (0x0U<<0U)
#define RCC_PLL2CFGR_PLL2SRC_B_0X1          (0x1U<<0U)
#define RCC_PLL2CFGR_PLL2SRC_B_0X2          (0x2U<<0U)
#define RCC_PLL2CFGR_PLL2SRC_B_0X3          (0x3U<<0U)

// PLL3CFGR Configuration

#define RCC_PLL3CFGR_PLL3REN                (0x1U<<18U)
#define RCC_PLL3CFGR_PLL3QEN                (0x1U<<17U)
#define RCC_PLL3CFGR_PLL3PEN                (0x1U<<16U)
#define RCC_PLL3CFGR_PLL3M                  (0xFU<<8U)
#define RCC_PLL3CFGR_PLL3M_0                (0x1U<<8U)
#define RCC_PLL3CFGR_PLL3FRACEN             (0x1U<<4U)
#define RCC_PLL3CFGR_PLL3RGE                (0x3U<<2U)
#define RCC_PLL3CFGR_PLL3RGE_0              (0x1U<<2U)
#define RCC_PLL3CFGR_PLL3SRC                (0x3U<<0U)
#define RCC_PLL3CFGR_PLL3SRC_0              (0x1U<<0U)
#define RCC_PLL3CFGR_PLL3REN_B_0X0          (0x0U<<18U)
#define RCC_PLL3CFGR_PLL3REN_B_0X1          (0x1U<<18U)
#define RCC_PLL3CFGR_PLL3QEN_B_0X0          (0x0U<<17U)
#define RCC_PLL3CFGR_PLL3QEN_B_0X1          (0x1U<<17U)
#define RCC_PLL3CFGR_PLL3PEN_B_0X0          (0x0U<<16U)
#define RCC_PLL3CFGR_PLL3PEN_B_0X1          (0x1U<<16U)
#define RCC_PLL3CFGR_PLL3M_B_0X0            (0x0U<<8U)
#define RCC_PLL3CFGR_PLL3M_B_0X1            (0x1U<<8U)
#define RCC_PLL3CFGR_PLL3M_B_0X2            (0x2U<<8U)
#define RCC_PLL3CFGR_PLL3M_B_0XF            (0xFU<<8U)
#define RCC_PLL3CFGR_PLL3RGE_B_0X3          (0x3U<<2U)
#define RCC_PLL3CFGR_PLL3SRC_B_0X0          (0x0U<<0U)
#define RCC_PLL3CFGR_PLL3SRC_B_0X1          (0x1U<<0U)
#define RCC_PLL3CFGR_PLL3SRC_B_0X2          (0x2U<<0U)
#define RCC_PLL3CFGR_PLL3SRC_B_0X3          (0x3U<<0U)

// PLL1DIVR Configuration

#define RCC_PLL1DIVR_PLL1R                  (0x7FU<<24U)
#define RCC_PLL1DIVR_PLL1R_0                (0x1U<<24U)
#define RCC_PLL1DIVR_PLL1Q                  (0x7FU<<16U)
#define RCC_PLL1DIVR_PLL1Q_0                (0x1U<<16U)
#define RCC_PLL1DIVR_PLL1P                  (0x7FU<<9U)
#define RCC_PLL1DIVR_PLL1P_0                (0x1U<<9U)
#define RCC_PLL1DIVR_PLL1N                  (0x1FFU<<0U)
#define RCC_PLL1DIVR_PLL1N_0                (0x1U<<0U)
#define RCC_PLL1DIVR_PLL1R_B_0X0            (0x0U<<24U)
#define RCC_PLL1DIVR_PLL1R_B_0X1            (0x1U<<24U)
#define RCC_PLL1DIVR_PLL1R_B_0X2            (0x2U<<24U)
#define RCC_PLL1DIVR_PLL1R_B_0X3            (0x3U<<24U)
#define RCC_PLL1DIVR_PLL1R_B_0X7F           (0x7FU<<24U)
#define RCC_PLL1DIVR_PLL1Q_B_0X0            (0x0U<<16U)
#define RCC_PLL1DIVR_PLL1Q_B_0X1            (0x1U<<16U)
#define RCC_PLL1DIVR_PLL1Q_B_0X2            (0x2U<<16U)
#define RCC_PLL1DIVR_PLL1Q_B_0X3            (0x3U<<16U)
#define RCC_PLL1DIVR_PLL1Q_B_0X7F           (0x7FU<<16U)
#define RCC_PLL1DIVR_PLL1P_B_0X0            (0x0U<<9U)
#define RCC_PLL1DIVR_PLL1P_B_0X1            (0x1U<<9U)
#define RCC_PLL1DIVR_PLL1P_B_0X2            (0x2U<<9U)
#define RCC_PLL1DIVR_PLL1P_B_0X3            (0x3U<<9U)
#define RCC_PLL1DIVR_PLL1P_B_0X7F           (0x7FU<<9U)
#define RCC_PLL1DIVR_PLL1N_B_0X003          (0x3U<<0U)
#define RCC_PLL1DIVR_PLL1N_B_0X004          (0x4U<<0U)
#define RCC_PLL1DIVR_PLL1N_B_0X005          (0x5U<<0U)
#define RCC_PLL1DIVR_PLL1N_B_0X080          (0x80U<<0U)
#define RCC_PLL1DIVR_PLL1N_B_0X1FF          (0x1FFU<<0U)

// PLL1FRACR Configuration

