Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
#define RCC_PLL1FRACR_PLL1FRACN             (0x1FFFU<<3U)
#define RCC_PLL1FRACR_PLL1FRACN_0           (0x1U<<3U)

// PLL2DIVR Configuration

#define RCC_PLL2DIVR_PLL2R                  (0x7FU<<24U)
#define RCC_PLL2DIVR_PLL2R_0                (0x1U<<24U)
#define RCC_PLL2DIVR_PLL2Q                  (0x7FU<<16U)
#define RCC_PLL2DIVR_PLL2Q_0                (0x1U<<16U)
#define RCC_PLL2DIVR_PLL2P                  (0x7FU<<9U)
#define RCC_PLL2DIVR_PLL2P_0                (0x1U<<9U)
#define RCC_PLL2DIVR_PLL2N                  (0x1FFU<<0U)
#define RCC_PLL2DIVR_PLL2N_0                (0x1U<<0U)
#define RCC_PLL2DIVR_PLL2R_B_0X0            (0x0U<<24U)
#define RCC_PLL2DIVR_PLL2R_B_0X1            (0x1U<<24U)
#define RCC_PLL2DIVR_PLL2R_B_0X2            (0x2U<<24U)
#define RCC_PLL2DIVR_PLL2R_B_0X3            (0x3U<<24U)
#define RCC_PLL2DIVR_PLL2R_B_0X7F           (0x7FU<<24U)
#define RCC_PLL2DIVR_PLL2Q_B_0X0            (0x0U<<16U)
#define RCC_PLL2DIVR_PLL2Q_B_0X1            (0x1U<<16U)
#define RCC_PLL2DIVR_PLL2Q_B_0X2            (0x2U<<16U)
#define RCC_PLL2DIVR_PLL2Q_B_0X3            (0x3U<<16U)
#define RCC_PLL2DIVR_PLL2Q_B_0X7F           (0x7FU<<16U)
#define RCC_PLL2DIVR_PLL2P_B_0X0            (0x0U<<9U)
#define RCC_PLL2DIVR_PLL2P_B_0X1            (0x1U<<9U)
#define RCC_PLL2DIVR_PLL2P_B_0X2            (0x2U<<9U)
#define RCC_PLL2DIVR_PLL2P_B_0X3            (0x3U<<9U)
#define RCC_PLL2DIVR_PLL2P_B_0X7F           (0x7FU<<9U)
#define RCC_PLL2DIVR_PLL2N_B_0X003          (0x3U<<0U)
#define RCC_PLL2DIVR_PLL2N_B_0X004          (0x4U<<0U)
#define RCC_PLL2DIVR_PLL2N_B_0X005          (0x5U<<0U)
#define RCC_PLL2DIVR_PLL2N_B_0X080          (0x80U<<0U)
#define RCC_PLL2DIVR_PLL2N_B_0X1FF          (0x1FFU<<0U)

// PLL2FRACR Configuration

#define RCC_PLL2FRACR_PLL2FRACN             (0x1FFFU<<3U)
#define RCC_PLL2FRACR_PLL2FRACN_0           (0x1U<<3U)

// PLL3DIVR Configuration

#define RCC_PLL3DIVR_PLL3R                  (0x7FU<<24U)
#define RCC_PLL3DIVR_PLL3R_0                (0x1U<<24U)
#define RCC_PLL3DIVR_PLL3Q                  (0x7FU<<16U)
#define RCC_PLL3DIVR_PLL3Q_0                (0x1U<<16U)
#define RCC_PLL3DIVR_PLL3P                  (0x7FU<<9U)
#define RCC_PLL3DIVR_PLL3P_0                (0x1U<<9U)
#define RCC_PLL3DIVR_PLL3N                  (0x1FFU<<0U)
#define RCC_PLL3DIVR_PLL3N_0                (0x1U<<0U)
#define RCC_PLL3DIVR_PLL3R_B_0X0            (0x0U<<24U)
#define RCC_PLL3DIVR_PLL3R_B_0X1            (0x1U<<24U)
#define RCC_PLL3DIVR_PLL3R_B_0X2            (0x2U<<24U)
#define RCC_PLL3DIVR_PLL3R_B_0X3            (0x3U<<24U)
#define RCC_PLL3DIVR_PLL3R_B_0X7F           (0x7FU<<24U)
#define RCC_PLL3DIVR_PLL3Q_B_0X0            (0x0U<<16U)
#define RCC_PLL3DIVR_PLL3Q_B_0X1            (0x1U<<16U)
#define RCC_PLL3DIVR_PLL3Q_B_0X2            (0x2U<<16U)
#define RCC_PLL3DIVR_PLL3Q_B_0X3            (0x3U<<16U)
#define RCC_PLL3DIVR_PLL3Q_B_0X7F           (0x7FU<<16U)
#define RCC_PLL3DIVR_PLL3P_B_0X0            (0x0U<<9U)
#define RCC_PLL3DIVR_PLL3P_B_0X1            (0x1U<<9U)
#define RCC_PLL3DIVR_PLL3P_B_0X2            (0x2U<<9U)
#define RCC_PLL3DIVR_PLL3P_B_0X3            (0x3U<<9U)
#define RCC_PLL3DIVR_PLL3P_B_0X7F           (0x7FU<<9U)
#define RCC_PLL3DIVR_PLL3N_B_0X003          (0x3U<<0U)
#define RCC_PLL3DIVR_PLL3N_B_0X004          (0x4U<<0U)
#define RCC_PLL3DIVR_PLL3N_B_0X005          (0x5U<<0U)
#define RCC_PLL3DIVR_PLL3N_B_0X080          (0x80U<<0U)
#define RCC_PLL3DIVR_PLL3N_B_0X1FF          (0x1FFU<<0U)

// PLL3FRACR Configuration

#define RCC_PLL3FRACR_PLL3FRACN             (0x1FFFU<<3U)
#define RCC_PLL3FRACR_PLL3FRACN_0           (0x1U<<3U)

// CIER Configuration

#define RCC_CIER_SHSIRDYIE                  (0x1U<<12U)
#define RCC_CIER_MSIKRDYIE                  (0x1U<<11U)
#define RCC_CIER_PLL3RDYIE                  (0x1U<<8U)
#define RCC_CIER_PLL2RDYIE                  (0x1U<<7U)
#define RCC_CIER_PLL1RDYIE                  (0x1U<<6U)
#define RCC_CIER_HSI48RDYIE                 (0x1U<<5U)
#define RCC_CIER_HSERDYIE                   (0x1U<<4U)
#define RCC_CIER_HSIRDYIE                   (0x1U<<3U)
#define RCC_CIER_MSISRDYIE                  (0x1U<<2U)
#define RCC_CIER_LSERDYIE                   (0x1U<<1U)
#define RCC_CIER_LSIRDYIE                   (0x1U<<0U)
#define RCC_CIER_SHSIRDYIE_B_0X0            (0x0U<<12U)
#define RCC_CIER_SHSIRDYIE_B_0X1            (0x1U<<12U)
#define RCC_CIER_MSIKRDYIE_B_0X0            (0x0U<<11U)
#define RCC_CIER_MSIKRDYIE_B_0X1            (0x1U<<11U)
#define RCC_CIER_PLL3RDYIE_B_0X0            (0x0U<<8U)
#define RCC_CIER_PLL3RDYIE_B_0X1            (0x1U<<8U)
#define RCC_CIER_PLL2RDYIE_B_0X0            (0x0U<<7U)
#define RCC_CIER_PLL2RDYIE_B_0X1            (0x1U<<7U)
#define RCC_CIER_PLL1RDYIE_B_0X0            (0x0U<<6U)
#define RCC_CIER_PLL1RDYIE_B_0X1            (0x1U<<6U)
#define RCC_CIER_HSI48RDYIE_B_0X0           (0x0U<<5U)
#define RCC_CIER_HSI48RDYIE_B_0X1           (0x1U<<5U)
#define RCC_CIER_HSERDYIE_B_0X0             (0x0U<<4U)
#define RCC_CIER_HSERDYIE_B_0X1             (0x1U<<4U)
#define RCC_CIER_HSIRDYIE_B_0X0             (0x0U<<3U)
#define RCC_CIER_HSIRDYIE_B_0X1             (0x1U<<3U)
#define RCC_CIER_MSISRDYIE_B_0X0            (0x0U<<2U)
#define RCC_CIER_MSISRDYIE_B_0X1            (0x1U<<2U)
#define RCC_CIER_LSERDYIE_B_0X0             (0x0U<<1U)
#define RCC_CIER_LSERDYIE_B_0X1             (0x1U<<1U)
#define RCC_CIER_LSIRDYIE_B_0X0             (0x0U<<0U)
#define RCC_CIER_LSIRDYIE_B_0X1             (0x1U<<0U)

// CIFR Configuration

#define RCC_CIFR_SHSIRDYF                   (0x1U<<12U)
#define RCC_CIFR_MSIKRDYF                   (0x1U<<11U)
#define RCC_CIFR_CSSF                       (0x1U<<10U)
#define RCC_CIFR_PLL3RDYF                   (0x1U<<8U)
#define RCC_CIFR_PLL2RDYF                   (0x1U<<7U)
#define RCC_CIFR_PLL1RDYF                   (0x1U<<6U)
#define RCC_CIFR_HSI48RDYF                  (0x1U<<5U)
#define RCC_CIFR_HSERDYF                    (0x1U<<4U)
#define RCC_CIFR_HSIRDYF                    (0x1U<<3U)
#define RCC_CIFR_MSISRDYF                   (0x1U<<2U)
#define RCC_CIFR_LSERDYF                    (0x1U<<1U)
#define RCC_CIFR_LSIRDYF                    (0x1U<<0U)
#define RCC_CIFR_SHSIRDYF_B_0X0             (0x0U<<12U)
#define RCC_CIFR_SHSIRDYF_B_0X1             (0x1U<<12U)
#define RCC_CIFR_MSIKRDYF_B_0X0             (0x0U<<11U)
#define RCC_CIFR_MSIKRDYF_B_0X1             (0x1U<<11U)
#define RCC_CIFR_CSSF_B_0X0                 (0x0U<<10U)
#define RCC_CIFR_CSSF_B_0X1                 (0x1U<<10U)
#define RCC_CIFR_PLL3RDYF_B_0X0             (0x0U<<8U)
#define RCC_CIFR_PLL3RDYF_B_0X1             (0x1U<<8U)
#define RCC_CIFR_PLL2RDYF_B_0X0             (0x0U<<7U)
#define RCC_CIFR_PLL2RDYF_B_0X1             (0x1U<<7U)
#define RCC_CIFR_PLL1RDYF_B_0X0             (0x0U<<6U)
#define RCC_CIFR_PLL1RDYF_B_0X1             (0x1U<<6U)
#define RCC_CIFR_HSI48RDYF_B_0X0            (0x0U<<5U)
#define RCC_CIFR_HSI48RDYF_B_0X1            (0x1U<<5U)
#define RCC_CIFR_HSERDYF_B_0X0              (0x0U<<4U)
#define RCC_CIFR_HSERDYF_B_0X1              (0x1U<<4U)
#define RCC_CIFR_HSIRDYF_B_0X0              (0x0U<<3U)
#define RCC_CIFR_HSIRDYF_B_0X1              (0x1U<<3U)
#define RCC_CIFR_MSISRDYF_B_0X0             (0x0U<<2U)
#define RCC_CIFR_MSISRDYF_B_0X1             (0x1U<<2U)
#define RCC_CIFR_LSERDYF_B_0X0              (0x0U<<1U)
#define RCC_CIFR_LSERDYF_B_0X1              (0x1U<<1U)
#define RCC_CIFR_LSIRDYF_B_0X0              (0x0U<<0U)
#define RCC_CIFR_LSIRDYF_B_0X1              (0x1U<<0U)

// CICR Configuration

#define RCC_CICR_SHSIRDYC                   (0x1U<<12U)
#define RCC_CICR_MSIKRDYC                   (0x1U<<11U)
#define RCC_CICR_CSSC                       (0x1U<<10U)
#define RCC_CICR_PLL3RDYC                   (0x1U<<8U)
#define RCC_CICR_PLL2RDYC                   (0x1U<<7U)
#define RCC_CICR_PLL1RDYC                   (0x1U<<6U)
#define RCC_CICR_HSI48RDYC                  (0x1U<<5U)
#define RCC_CICR_HSERDYC                    (0x1U<<4U)
#define RCC_CICR_HSIRDYC                    (0x1U<<3U)
#define RCC_CICR_MSISRDYC                   (0x1U<<2U)
#define RCC_CICR_LSERDYC                    (0x1U<<1U)
#define RCC_CICR_LSIRDYC                    (0x1U<<0U)

// AHB1RSTR Configuration

