Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
#define RCC_AHB1RSTR_GPU2DRST               (0x1U<<20U)
#define RCC_AHB1RSTR_GFXMMURST              (0x1U<<19U)
#define RCC_AHB1RSTR_DMA2DRST               (0x1U<<18U)
#define RCC_AHB1RSTR_RAMCFGRST              (0x1U<<17U)
#define RCC_AHB1RSTR_TSCRST                 (0x1U<<16U)
#define RCC_AHB1RSTR_JPEGRST                (0x1U<<15U)
#define RCC_AHB1RSTR_CRCRST                 (0x1U<<12U)
#define RCC_AHB1RSTR_MDF1RST                (0x1U<<3U)
#define RCC_AHB1RSTR_FMACRST                (0x1U<<2U)
#define RCC_AHB1RSTR_CORDICRST              (0x1U<<1U)
#define RCC_AHB1RSTR_GPDMA1RST              (0x1U<<0U)
#define RCC_AHB1RSTR_GPU2DRST_B_0X0         (0x0U<<20U)
#define RCC_AHB1RSTR_GPU2DRST_B_0X1         (0x1U<<20U)
#define RCC_AHB1RSTR_GFXMMURST_B_0X0        (0x0U<<19U)
#define RCC_AHB1RSTR_GFXMMURST_B_0X1        (0x1U<<19U)
#define RCC_AHB1RSTR_DMA2DRST_B_0X0         (0x0U<<18U)
#define RCC_AHB1RSTR_DMA2DRST_B_0X1         (0x1U<<18U)
#define RCC_AHB1RSTR_RAMCFGRST_B_0X0        (0x0U<<17U)
#define RCC_AHB1RSTR_RAMCFGRST_B_0X1        (0x1U<<17U)
#define RCC_AHB1RSTR_TSCRST_B_0X0           (0x0U<<16U)
#define RCC_AHB1RSTR_TSCRST_B_0X1           (0x1U<<16U)
#define RCC_AHB1RSTR_JPEGRST_B_0X0          (0x0U<<15U)
#define RCC_AHB1RSTR_JPEGRST_B_0X1          (0x1U<<15U)
#define RCC_AHB1RSTR_CRCRST_B_0X0           (0x0U<<12U)
#define RCC_AHB1RSTR_CRCRST_B_0X1           (0x1U<<12U)
#define RCC_AHB1RSTR_MDF1RST_B_0X0          (0x0U<<3U)
#define RCC_AHB1RSTR_MDF1RST_B_0X1          (0x1U<<3U)
#define RCC_AHB1RSTR_FMACRST_B_0X0          (0x0U<<2U)
#define RCC_AHB1RSTR_FMACRST_B_0X1          (0x1U<<2U)
#define RCC_AHB1RSTR_CORDICRST_B_0X0        (0x0U<<1U)
#define RCC_AHB1RSTR_CORDICRST_B_0X1        (0x1U<<1U)
#define RCC_AHB1RSTR_GPDMA1RST_B_0X0        (0x0U<<0U)
#define RCC_AHB1RSTR_GPDMA1RST_B_0X1        (0x1U<<0U)

// AHB2RSTR1 Configuration

#define RCC_AHB2RSTR1_SDMMC2RST             (0x1U<<28U)
#define RCC_AHB2RSTR1_SDMMC1RST             (0x1U<<27U)
#define RCC_AHB2RSTR1_OTFDEC2RST            (0x1U<<24U)
#define RCC_AHB2RSTR1_OTFDEC1RST            (0x1U<<23U)
#define RCC_AHB2RSTR1_OCTOSPIMRST           (0x1U<<21U)
#define RCC_AHB2RSTR1_SAESRST               (0x1U<<20U)
#define RCC_AHB2RSTR1_PKARST                (0x1U<<19U)
#define RCC_AHB2RSTR1_RNGRST                (0x1U<<18U)
#define RCC_AHB2RSTR1_HASHRST               (0x1U<<17U)
#define RCC_AHB2RSTR1_AESRST                (0x1U<<16U)
#define RCC_AHB2RSTR1_OTGRST                (0x1U<<14U)
#define RCC_AHB2RSTR1_DCMI_PSSIRST          (0x1U<<12U)
#define RCC_AHB2RSTR1_ADC12RST              (0x1U<<10U)
#define RCC_AHB2RSTR1_GPIOJRST              (0x1U<<9U)
#define RCC_AHB2RSTR1_GPIOIRST              (0x1U<<8U)
#define RCC_AHB2RSTR1_GPIOHRST              (0x1U<<7U)
#define RCC_AHB2RSTR1_GPIOGRST              (0x1U<<6U)
#define RCC_AHB2RSTR1_GPIOFRST              (0x1U<<5U)
#define RCC_AHB2RSTR1_GPIOERST              (0x1U<<4U)
#define RCC_AHB2RSTR1_GPIODRST              (0x1U<<3U)
#define RCC_AHB2RSTR1_GPIOCRST              (0x1U<<2U)
#define RCC_AHB2RSTR1_GPIOBRST              (0x1U<<1U)
#define RCC_AHB2RSTR1_GPIOARST              (0x1U<<0U)
#define RCC_AHB2RSTR1_SDMMC2RST_B_0X0       (0x0U<<28U)
#define RCC_AHB2RSTR1_SDMMC2RST_B_0X1       (0x1U<<28U)
#define RCC_AHB2RSTR1_SDMMC1RST_B_0X0       (0x0U<<27U)
#define RCC_AHB2RSTR1_SDMMC1RST_B_0X1       (0x1U<<27U)
#define RCC_AHB2RSTR1_OTFDEC2RST_B_0X0      (0x0U<<24U)
#define RCC_AHB2RSTR1_OTFDEC2RST_B_0X1      (0x1U<<24U)
#define RCC_AHB2RSTR1_OTFDEC1RST_B_0X0      (0x0U<<23U)
#define RCC_AHB2RSTR1_OTFDEC1RST_B_0X1      (0x1U<<23U)
#define RCC_AHB2RSTR1_OCTOSPIMRST_B_0X0     (0x0U<<21U)
#define RCC_AHB2RSTR1_OCTOSPIMRST_B_0X1     (0x1U<<21U)
#define RCC_AHB2RSTR1_SAESRST_B_0X0         (0x0U<<20U)
#define RCC_AHB2RSTR1_SAESRST_B_0X1         (0x1U<<20U)
#define RCC_AHB2RSTR1_PKARST_B_0X0          (0x0U<<19U)
#define RCC_AHB2RSTR1_PKARST_B_0X1          (0x1U<<19U)
#define RCC_AHB2RSTR1_RNGRST_B_0X0          (0x0U<<18U)
#define RCC_AHB2RSTR1_RNGRST_B_0X1          (0x1U<<18U)
#define RCC_AHB2RSTR1_HASHRST_B_0X0         (0x0U<<17U)
#define RCC_AHB2RSTR1_HASHRST_B_0X1         (0x1U<<17U)
#define RCC_AHB2RSTR1_AESRST_B_0X0          (0x0U<<16U)
#define RCC_AHB2RSTR1_AESRST_B_0X1          (0x1U<<16U)
#define RCC_AHB2RSTR1_OTGRST_B_0X0          (0x0U<<14U)
#define RCC_AHB2RSTR1_OTGRST_B_0X1          (0x1U<<14U)
#define RCC_AHB2RSTR1_DCMI_PSSIRST_B_0X0    (0x0U<<12U)
#define RCC_AHB2RSTR1_DCMI_PSSIRST_B_0X1    (0x1U<<12U)
#define RCC_AHB2RSTR1_ADC12RST_B_0X0        (0x0U<<10U)
#define RCC_AHB2RSTR1_ADC12RST_B_0X1        (0x1U<<10U)
#define RCC_AHB2RSTR1_GPIOJRST_B_0X0        (0x0U<<9U)
#define RCC_AHB2RSTR1_GPIOJRST_B_0X1        (0x1U<<9U)
#define RCC_AHB2RSTR1_GPIOIRST_B_0X0        (0x0U<<8U)
#define RCC_AHB2RSTR1_GPIOIRST_B_0X1        (0x1U<<8U)
#define RCC_AHB2RSTR1_GPIOHRST_B_0X0        (0x0U<<7U)
#define RCC_AHB2RSTR1_GPIOHRST_B_0X1        (0x1U<<7U)
#define RCC_AHB2RSTR1_GPIOGRST_B_0X0        (0x0U<<6U)
#define RCC_AHB2RSTR1_GPIOGRST_B_0X1        (0x1U<<6U)
#define RCC_AHB2RSTR1_GPIOFRST_B_0X0        (0x0U<<5U)
#define RCC_AHB2RSTR1_GPIOFRST_B_0X1        (0x1U<<5U)
#define RCC_AHB2RSTR1_GPIOERST_B_0X0        (0x0U<<4U)
#define RCC_AHB2RSTR1_GPIOERST_B_0X1        (0x1U<<4U)
#define RCC_AHB2RSTR1_GPIODRST_B_0X0        (0x0U<<3U)
#define RCC_AHB2RSTR1_GPIODRST_B_0X1        (0x1U<<3U)
#define RCC_AHB2RSTR1_GPIOCRST_B_0X0        (0x0U<<2U)
#define RCC_AHB2RSTR1_GPIOCRST_B_0X1        (0x1U<<2U)
#define RCC_AHB2RSTR1_GPIOBRST_B_0X0        (0x0U<<1U)
#define RCC_AHB2RSTR1_GPIOBRST_B_0X1        (0x1U<<1U)
#define RCC_AHB2RSTR1_GPIOARST_B_0X0        (0x0U<<0U)
#define RCC_AHB2RSTR1_GPIOARST_B_0X1        (0x1U<<0U)

// AHB2RSTR2 Configuration

#define RCC_AHB2RSTR2_HSPI1RST              (0x1U<<12U)
#define RCC_AHB2RSTR2_OCTOSPI2RST           (0x1U<<8U)
#define RCC_AHB2RSTR2_OCTOSPI1RST           (0x1U<<4U)
#define RCC_AHB2RSTR2_FSMCRST               (0x1U<<0U)
#define RCC_AHB2RSTR2_HSPI1RST_B_0X0        (0x0U<<12U)
#define RCC_AHB2RSTR2_HSPI1RST_B_0X1        (0x1U<<12U)
#define RCC_AHB2RSTR2_OCTOSPI2RST_B_0X0     (0x0U<<8U)
#define RCC_AHB2RSTR2_OCTOSPI2RST_B_0X1     (0x1U<<8U)
#define RCC_AHB2RSTR2_OCTOSPI1RST_B_0X0     (0x0U<<4U)
#define RCC_AHB2RSTR2_OCTOSPI1RST_B_0X1     (0x1U<<4U)
#define RCC_AHB2RSTR2_FSMCRST_B_0X0         (0x0U<<0U)
#define RCC_AHB2RSTR2_FSMCRST_B_0X1         (0x1U<<0U)

