Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
// AHB3RSTR Configuration

#define RCC_AHB3RSTR_ADF1RST                (0x1U<<10U)
#define RCC_AHB3RSTR_LPDMA1RST              (0x1U<<9U)
#define RCC_AHB3RSTR_DAC1RST                (0x1U<<6U)
#define RCC_AHB3RSTR_ADC4RST                (0x1U<<5U)
#define RCC_AHB3RSTR_LPGPIO1RST             (0x1U<<0U)
#define RCC_AHB3RSTR_ADF1RST_B_0X0          (0x0U<<10U)
#define RCC_AHB3RSTR_ADF1RST_B_0X1          (0x1U<<10U)
#define RCC_AHB3RSTR_LPDMA1RST_B_0X0        (0x0U<<9U)
#define RCC_AHB3RSTR_LPDMA1RST_B_0X1        (0x1U<<9U)
#define RCC_AHB3RSTR_DAC1RST_B_0X0          (0x0U<<6U)
#define RCC_AHB3RSTR_DAC1RST_B_0X1          (0x1U<<6U)
#define RCC_AHB3RSTR_ADC4RST_B_0X0          (0x0U<<5U)
#define RCC_AHB3RSTR_ADC4RST_B_0X1          (0x1U<<5U)
#define RCC_AHB3RSTR_LPGPIO1RST_B_0X0       (0x0U<<0U)
#define RCC_AHB3RSTR_LPGPIO1RST_B_0X1       (0x1U<<0U)

// APB1RSTR1 Configuration

#define RCC_APB1RSTR1_USART6RST             (0x1U<<25U)
#define RCC_APB1RSTR1_CRSRST                (0x1U<<24U)
#define RCC_APB1RSTR1_I2C2RST               (0x1U<<22U)
#define RCC_APB1RSTR1_I2C1RST               (0x1U<<21U)
#define RCC_APB1RSTR1_UART5RST              (0x1U<<20U)
#define RCC_APB1RSTR1_UART4RST              (0x1U<<19U)
#define RCC_APB1RSTR1_USART3RST             (0x1U<<18U)
#define RCC_APB1RSTR1_USART2RST             (0x1U<<17U)
#define RCC_APB1RSTR1_SPI2RST               (0x1U<<14U)
#define RCC_APB1RSTR1_TIM7RST               (0x1U<<5U)
#define RCC_APB1RSTR1_TIM6RST               (0x1U<<4U)
#define RCC_APB1RSTR1_TIM5RST               (0x1U<<3U)
#define RCC_APB1RSTR1_TIM4RST               (0x1U<<2U)
#define RCC_APB1RSTR1_TIM3RST               (0x1U<<1U)
#define RCC_APB1RSTR1_TIM2RST               (0x1U<<0U)
#define RCC_APB1RSTR1_USART6RST_B_0X0       (0x0U<<25U)
#define RCC_APB1RSTR1_USART6RST_B_0X1       (0x1U<<25U)
#define RCC_APB1RSTR1_CRSRST_B_0X0          (0x0U<<24U)
#define RCC_APB1RSTR1_CRSRST_B_0X1          (0x1U<<24U)
#define RCC_APB1RSTR1_I2C2RST_B_0X0         (0x0U<<22U)
#define RCC_APB1RSTR1_I2C2RST_B_0X1         (0x1U<<22U)
#define RCC_APB1RSTR1_I2C1RST_B_0X0         (0x0U<<21U)
#define RCC_APB1RSTR1_I2C1RST_B_0X1         (0x1U<<21U)
#define RCC_APB1RSTR1_UART5RST_B_0X0        (0x0U<<20U)
#define RCC_APB1RSTR1_UART5RST_B_0X1        (0x1U<<20U)
#define RCC_APB1RSTR1_UART4RST_B_0X0        (0x0U<<19U)
#define RCC_APB1RSTR1_UART4RST_B_0X1        (0x1U<<19U)
#define RCC_APB1RSTR1_USART3RST_B_0X0       (0x0U<<18U)
#define RCC_APB1RSTR1_USART3RST_B_0X1       (0x1U<<18U)
#define RCC_APB1RSTR1_USART2RST_B_0X0       (0x0U<<17U)
#define RCC_APB1RSTR1_USART2RST_B_0X1       (0x1U<<17U)
#define RCC_APB1RSTR1_SPI2RST_B_0X0         (0x0U<<14U)
#define RCC_APB1RSTR1_SPI2RST_B_0X1         (0x1U<<14U)
#define RCC_APB1RSTR1_TIM7RST_B_0X0         (0x0U<<5U)
#define RCC_APB1RSTR1_TIM7RST_B_0X1         (0x1U<<5U)
#define RCC_APB1RSTR1_TIM6RST_B_0X0         (0x0U<<4U)
#define RCC_APB1RSTR1_TIM6RST_B_0X1         (0x1U<<4U)
#define RCC_APB1RSTR1_TIM5RST_B_0X0         (0x0U<<3U)
#define RCC_APB1RSTR1_TIM5RST_B_0X1         (0x1U<<3U)
#define RCC_APB1RSTR1_TIM4RST_B_0X0         (0x0U<<2U)
#define RCC_APB1RSTR1_TIM4RST_B_0X1         (0x1U<<2U)
#define RCC_APB1RSTR1_TIM3RST_B_0X0         (0x0U<<1U)
#define RCC_APB1RSTR1_TIM3RST_B_0X1         (0x1U<<1U)
#define RCC_APB1RSTR1_TIM2RST_B_0X0         (0x0U<<0U)
#define RCC_APB1RSTR1_TIM2RST_B_0X1         (0x1U<<0U)

// APB1RSTR2 Configuration

#define RCC_APB1RSTR2_UCPD1RST              (0x1U<<23U)
#define RCC_APB1RSTR2_FDCAN1RST             (0x1U<<9U)
#define RCC_APB1RSTR2_I2C6RST               (0x1U<<7U)
#define RCC_APB1RSTR2_I2C5RST               (0x1U<<6U)
#define RCC_APB1RSTR2_LPTIM2RST             (0x1U<<5U)
#define RCC_APB1RSTR2_I2C4RST               (0x1U<<1U)
#define RCC_APB1RSTR2_UCPD1RST_B_0X0        (0x0U<<23U)
#define RCC_APB1RSTR2_UCPD1RST_B_0X1        (0x1U<<23U)
#define RCC_APB1RSTR2_FDCAN1RST_B_0X0       (0x0U<<9U)
#define RCC_APB1RSTR2_FDCAN1RST_B_0X1       (0x1U<<9U)
#define RCC_APB1RSTR2_I2C6RST_B_0X0         (0x0U<<7U)
#define RCC_APB1RSTR2_I2C6RST_B_0X1         (0x1U<<7U)
#define RCC_APB1RSTR2_I2C5RST_B_0X0         (0x0U<<6U)
#define RCC_APB1RSTR2_I2C5RST_B_0X1         (0x1U<<6U)
#define RCC_APB1RSTR2_LPTIM2RST_B_0X0       (0x0U<<5U)
#define RCC_APB1RSTR2_LPTIM2RST_B_0X1       (0x1U<<5U)
#define RCC_APB1RSTR2_I2C4RST_B_0X0         (0x0U<<1U)
#define RCC_APB1RSTR2_I2C4RST_B_0X1         (0x1U<<1U)

// APB2RSTR Configuration

#define RCC_APB2RSTR_DSIRST                 (0x1U<<27U)
#define RCC_APB2RSTR_LTDCRST                (0x1U<<26U)
#define RCC_APB2RSTR_GFXTIMRST              (0x1U<<25U)
#define RCC_APB2RSTR_USBRST                 (0x1U<<24U)
#define RCC_APB2RSTR_SAI2RST                (0x1U<<22U)
#define RCC_APB2RSTR_SAI1RST                (0x1U<<21U)
#define RCC_APB2RSTR_TIM17RST               (0x1U<<18U)
#define RCC_APB2RSTR_TIM16RST               (0x1U<<17U)
#define RCC_APB2RSTR_TIM15RST               (0x1U<<16U)
#define RCC_APB2RSTR_USART1RST              (0x1U<<14U)
#define RCC_APB2RSTR_TIM8RST                (0x1U<<13U)
#define RCC_APB2RSTR_SPI1RST                (0x1U<<12U)
#define RCC_APB2RSTR_TIM1RST                (0x1U<<11U)
#define RCC_APB2RSTR_DSIRST_B_0X0           (0x0U<<27U)
#define RCC_APB2RSTR_DSIRST_B_0X1           (0x1U<<27U)
#define RCC_APB2RSTR_LTDCRST_B_0X0          (0x0U<<26U)
#define RCC_APB2RSTR_LTDCRST_B_0X1          (0x1U<<26U)
#define RCC_APB2RSTR_GFXTIMRST_B_0X0        (0x0U<<25U)
#define RCC_APB2RSTR_GFXTIMRST_B_0X1        (0x1U<<25U)
#define RCC_APB2RSTR_USBRST_B_0X0           (0x0U<<24U)
#define RCC_APB2RSTR_USBRST_B_0X1           (0x1U<<24U)
#define RCC_APB2RSTR_SAI2RST_B_0X0          (0x0U<<22U)
#define RCC_APB2RSTR_SAI2RST_B_0X1          (0x1U<<22U)
#define RCC_APB2RSTR_SAI1RST_B_0X0          (0x0U<<21U)
#define RCC_APB2RSTR_SAI1RST_B_0X1          (0x1U<<21U)
#define RCC_APB2RSTR_TIM17RST_B_0X0         (0x0U<<18U)
#define RCC_APB2RSTR_TIM17RST_B_0X1         (0x1U<<18U)
#define RCC_APB2RSTR_TIM16RST_B_0X0         (0x0U<<17U)
#define RCC_APB2RSTR_TIM16RST_B_0X1         (0x1U<<17U)
#define RCC_APB2RSTR_TIM15RST_B_0X0         (0x0U<<16U)
#define RCC_APB2RSTR_TIM15RST_B_0X1         (0x1U<<16U)
#define RCC_APB2RSTR_USART1RST_B_0X0        (0x0U<<14U)
#define RCC_APB2RSTR_USART1RST_B_0X1        (0x1U<<14U)
#define RCC_APB2RSTR_TIM8RST_B_0X0          (0x0U<<13U)
#define RCC_APB2RSTR_TIM8RST_B_0X1          (0x1U<<13U)
#define RCC_APB2RSTR_SPI1RST_B_0X0          (0x0U<<12U)
#define RCC_APB2RSTR_SPI1RST_B_0X1          (0x1U<<12U)
#define RCC_APB2RSTR_TIM1RST_B_0X0          (0x0U<<11U)
#define RCC_APB2RSTR_TIM1RST_B_0X1          (0x1U<<11U)

// APB3RSTR Configuration

#define RCC_APB3RSTR_VREFRST                (0x1U<<20U)
#define RCC_APB3RSTR_COMPRST                (0x1U<<15U)
#define RCC_APB3RSTR_OPAMPRST               (0x1U<<14U)
#define RCC_APB3RSTR_LPTIM4RST              (0x1U<<13U)
#define RCC_APB3RSTR_LPTIM3RST              (0x1U<<12U)
#define RCC_APB3RSTR_LPTIM1RST              (0x1U<<11U)
#define RCC_APB3RSTR_I2C3RST                (0x1U<<7U)
#define RCC_APB3RSTR_LPUART1RST             (0x1U<<6U)
#define RCC_APB3RSTR_SPI3RST                (0x1U<<5U)
#define RCC_APB3RSTR_SYSCFGRST              (0x1U<<1U)
#define RCC_APB3RSTR_VREFRST_B_0X0          (0x0U<<20U)
#define RCC_APB3RSTR_VREFRST_B_0X1          (0x1U<<20U)
#define RCC_APB3RSTR_COMPRST_B_0X0          (0x0U<<15U)
#define RCC_APB3RSTR_COMPRST_B_0X1          (0x1U<<15U)
#define RCC_APB3RSTR_OPAMPRST_B_0X0         (0x0U<<14U)
#define RCC_APB3RSTR_OPAMPRST_B_0X1         (0x1U<<14U)
#define RCC_APB3RSTR_LPTIM4RST_B_0X0        (0x0U<<13U)
#define RCC_APB3RSTR_LPTIM4RST_B_0X1        (0x1U<<13U)
#define RCC_APB3RSTR_LPTIM3RST_B_0X0        (0x0U<<12U)
#define RCC_APB3RSTR_LPTIM3RST_B_0X1        (0x1U<<12U)
#define RCC_APB3RSTR_LPTIM1RST_B_0X0        (0x0U<<11U)
#define RCC_APB3RSTR_LPTIM1RST_B_0X1        (0x1U<<11U)
#define RCC_APB3RSTR_I2C3RST_B_0X0          (0x0U<<7U)
#define RCC_APB3RSTR_I2C3RST_B_0X1          (0x1U<<7U)
#define RCC_APB3RSTR_LPUART1RST_B_0X0       (0x0U<<6U)
#define RCC_APB3RSTR_LPUART1RST_B_0X1       (0x1U<<6U)
#define RCC_APB3RSTR_SPI3RST_B_0X0          (0x0U<<5U)
#define RCC_APB3RSTR_SPI3RST_B_0X1          (0x1U<<5U)
#define RCC_APB3RSTR_SYSCFGRST_B_0X0        (0x0U<<1U)
#define RCC_APB3RSTR_SYSCFGRST_B_0X1        (0x1U<<1U)

// AHB1ENR Configuration

#define RCC_AHB1ENR_SRAM1EN                 (0x1U<<31U)
#define RCC_AHB1ENR_DCACHE1EN               (0x1U<<30U)
#define RCC_AHB1ENR_BKPSRAMEN               (0x1U<<28U)
#define RCC_AHB1ENR_GTZC1EN                 (0x1U<<24U)
#define RCC_AHB1ENR_DCACHE2EN               (0x1U<<21U)
#define RCC_AHB1ENR_GPU2DEN                 (0x1U<<20U)
#define RCC_AHB1ENR_GFXMMUEN                (0x1U<<19U)
#define RCC_AHB1ENR_DMA2DEN                 (0x1U<<18U)
#define RCC_AHB1ENR_RAMCFGEN                (0x1U<<17U)
#define RCC_AHB1ENR_TSCEN                   (0x1U<<16U)
#define RCC_AHB1ENR_JPEGEN                  (0x1U<<15U)
#define RCC_AHB1ENR_CRCEN                   (0x1U<<12U)
#define RCC_AHB1ENR_FLASHEN                 (0x1U<<8U)
#define RCC_AHB1ENR_MDF1EN                  (0x1U<<3U)
#define RCC_AHB1ENR_FMACEN                  (0x1U<<2U)
#define RCC_AHB1ENR_CORDICEN                (0x1U<<1U)
#define RCC_AHB1ENR_GPDMA1EN                (0x1U<<0U)
#define RCC_AHB1ENR_SRAM1EN_B_0X0           (0x0U<<31U)
#define RCC_AHB1ENR_SRAM1EN_B_0X1           (0x1U<<31U)
#define RCC_AHB1ENR_DCACHE1EN_B_0X0         (0x0U<<30U)
#define RCC_AHB1ENR_DCACHE1EN_B_0X1         (0x1U<<30U)
#define RCC_AHB1ENR_BKPSRAMEN_B_0X0         (0x0U<<28U)
#define RCC_AHB1ENR_BKPSRAMEN_B_0X1         (0x1U<<28U)
#define RCC_AHB1ENR_GTZC1EN_B_0X0           (0x0U<<24U)
#define RCC_AHB1ENR_GTZC1EN_B_0X1           (0x1U<<24U)
#define RCC_AHB1ENR_DCACHE2EN_B_0X0         (0x0U<<21U)
#define RCC_AHB1ENR_DCACHE2EN_B_0X1         (0x1U<<21U)
#define RCC_AHB1ENR_GPU2DEN_B_0X0           (0x0U<<20U)
#define RCC_AHB1ENR_GPU2DEN_B_0X1           (0x1U<<20U)
#define RCC_AHB1ENR_GFXMMUEN_B_0X0          (0x0U<<19U)
#define RCC_AHB1ENR_GFXMMUEN_B_0X1          (0x1U<<19U)
#define RCC_AHB1ENR_DMA2DEN_B_0X0           (0x0U<<18U)
#define RCC_AHB1ENR_DMA2DEN_B_0X1           (0x1U<<18U)
#define RCC_AHB1ENR_RAMCFGEN_B_0X0          (0x0U<<17U)
#define RCC_AHB1ENR_RAMCFGEN_B_0X1          (0x1U<<17U)
#define RCC_AHB1ENR_TSCEN_B_0X0             (0x0U<<16U)
#define RCC_AHB1ENR_TSCEN_B_0X1             (0x1U<<16U)
#define RCC_AHB1ENR_JPEGEN_B_0X0            (0x0U<<15U)
#define RCC_AHB1ENR_JPEGEN_B_0X1            (0x1U<<15U)
#define RCC_AHB1ENR_CRCEN_B_0X0             (0x0U<<12U)
#define RCC_AHB1ENR_CRCEN_B_0X1             (0x1U<<12U)
#define RCC_AHB1ENR_FLASHEN_B_0X0           (0x0U<<8U)
#define RCC_AHB1ENR_FLASHEN_B_0X1           (0x1U<<8U)
#define RCC_AHB1ENR_MDF1EN_B_0X0            (0x0U<<3U)
#define RCC_AHB1ENR_MDF1EN_B_0X1            (0x1U<<3U)
#define RCC_AHB1ENR_FMACEN_B_0X0            (0x0U<<2U)
#define RCC_AHB1ENR_FMACEN_B_0X1            (0x1U<<2U)
#define RCC_AHB1ENR_CORDICEN_B_0X0          (0x0U<<1U)
#define RCC_AHB1ENR_CORDICEN_B_0X1          (0x1U<<1U)
#define RCC_AHB1ENR_GPDMA1EN_B_0X0          (0x0U<<0U)
#define RCC_AHB1ENR_GPDMA1EN_B_0X1          (0x1U<<0U)

// AHB2ENR1 Configuration

#define RCC_AHB2ENR1_SRAM3EN                (0x1U<<31U)
#define RCC_AHB2ENR1_SRAM2EN                (0x1U<<30U)
#define RCC_AHB2ENR1_SDMMC2EN               (0x1U<<28U)
#define RCC_AHB2ENR1_SDMMC1EN               (0x1U<<27U)
#define RCC_AHB2ENR1_OTFDEC2EN              (0x1U<<24U)
#define RCC_AHB2ENR1_OTFDEC1EN              (0x1U<<23U)
#define RCC_AHB2ENR1_OCTOSPIMEN             (0x1U<<21U)
#define RCC_AHB2ENR1_SAESEN                 (0x1U<<20U)
#define RCC_AHB2ENR1_PKAEN                  (0x1U<<19U)
#define RCC_AHB2ENR1_RNGEN                  (0x1U<<18U)
#define RCC_AHB2ENR1_HASHEN                 (0x1U<<17U)
#define RCC_AHB2ENR1_AESEN                  (0x1U<<16U)
#define RCC_AHB2ENR1_OTGHSPHYEN             (0x1U<<15U)
#define RCC_AHB2ENR1_OTGEN                  (0x1U<<14U)
#define RCC_AHB2ENR1_DCMI_PSSIEN            (0x1U<<12U)
#define RCC_AHB2ENR1_ADC12EN                (0x1U<<10U)
#define RCC_AHB2ENR1_GPIOJEN                (0x1U<<9U)
#define RCC_AHB2ENR1_GPIOIEN                (0x1U<<8U)
#define RCC_AHB2ENR1_GPIOHEN                (0x1U<<7U)
#define RCC_AHB2ENR1_GPIOGEN                (0x1U<<6U)
#define RCC_AHB2ENR1_GPIOFEN                (0x1U<<5U)
#define RCC_AHB2ENR1_GPIOEEN                (0x1U<<4U)
#define RCC_AHB2ENR1_GPIODEN                (0x1U<<3U)
#define RCC_AHB2ENR1_GPIOCEN                (0x1U<<2U)
#define RCC_AHB2ENR1_GPIOBEN                (0x1U<<1U)
#define RCC_AHB2ENR1_GPIOAEN                (0x1U<<0U)
#define RCC_AHB2ENR1_SRAM3EN_B_0X0          (0x0U<<31U)
#define RCC_AHB2ENR1_SRAM3EN_B_0X1          (0x1U<<31U)
#define RCC_AHB2ENR1_SRAM2EN_B_0X0          (0x0U<<30U)
#define RCC_AHB2ENR1_SRAM2EN_B_0X1          (0x1U<<30U)
#define RCC_AHB2ENR1_SDMMC2EN_B_0X0         (0x0U<<28U)
#define RCC_AHB2ENR1_SDMMC2EN_B_0X1         (0x1U<<28U)
#define RCC_AHB2ENR1_SDMMC1EN_B_0X0         (0x0U<<27U)
#define RCC_AHB2ENR1_SDMMC1EN_B_0X1         (0x1U<<27U)
#define RCC_AHB2ENR1_OTFDEC2EN_B_0X0        (0x0U<<24U)
#define RCC_AHB2ENR1_OTFDEC2EN_B_0X1        (0x1U<<24U)
#define RCC_AHB2ENR1_OTFDEC1EN_B_0X0        (0x0U<<23U)
#define RCC_AHB2ENR1_OTFDEC1EN_B_0X1        (0x1U<<23U)
#define RCC_AHB2ENR1_OCTOSPIMEN_B_0X0       (0x0U<<21U)
#define RCC_AHB2ENR1_OCTOSPIMEN_B_0X1       (0x1U<<21U)
#define RCC_AHB2ENR1_SAESEN_B_0X0           (0x0U<<20U)
#define RCC_AHB2ENR1_SAESEN_B_0X1           (0x1U<<20U)
#define RCC_AHB2ENR1_PKAEN_B_0X0            (0x0U<<19U)
#define RCC_AHB2ENR1_PKAEN_B_0X1            (0x1U<<19U)
#define RCC_AHB2ENR1_RNGEN_B_0X0            (0x0U<<18U)
#define RCC_AHB2ENR1_RNGEN_B_0X1            (0x1U<<18U)
#define RCC_AHB2ENR1_HASHEN_B_0X0           (0x0U<<17U)
#define RCC_AHB2ENR1_HASHEN_B_0X1           (0x1U<<17U)
#define RCC_AHB2ENR1_AESEN_B_0X0            (0x0U<<16U)
#define RCC_AHB2ENR1_AESEN_B_0X1            (0x1U<<16U)
#define RCC_AHB2ENR1_OTGHSPHYEN_B_0X0       (0x0U<<15U)
#define RCC_AHB2ENR1_OTGHSPHYEN_B_0X1       (0x1U<<15U)
#define RCC_AHB2ENR1_OTGEN_B_0X0            (0x0U<<14U)
#define RCC_AHB2ENR1_OTGEN_B_0X1            (0x1U<<14U)
#define RCC_AHB2ENR1_DCMI_PSSIEN_B_0X0      (0x0U<<12U)
#define RCC_AHB2ENR1_DCMI_PSSIEN_B_0X1      (0x1U<<12U)
#define RCC_AHB2ENR1_ADC12EN_B_0X0          (0x0U<<10U)
#define RCC_AHB2ENR1_ADC12EN_B_0X1          (0x1U<<10U)
#define RCC_AHB2ENR1_GPIOJEN_B_0X0          (0x0U<<9U)
#define RCC_AHB2ENR1_GPIOJEN_B_0X1          (0x1U<<9U)
#define RCC_AHB2ENR1_GPIOIEN_B_0X0          (0x0U<<8U)
#define RCC_AHB2ENR1_GPIOIEN_B_0X1          (0x1U<<8U)
#define RCC_AHB2ENR1_GPIOHEN_B_0X0          (0x0U<<7U)
#define RCC_AHB2ENR1_GPIOHEN_B_0X1          (0x1U<<7U)
#define RCC_AHB2ENR1_GPIOGEN_B_0X0          (0x0U<<6U)
#define RCC_AHB2ENR1_GPIOGEN_B_0X1          (0x1U<<6U)
#define RCC_AHB2ENR1_GPIOFEN_B_0X0          (0x0U<<5U)
#define RCC_AHB2ENR1_GPIOFEN_B_0X1          (0x1U<<5U)
#define RCC_AHB2ENR1_GPIOEEN_B_0X0          (0x0U<<4U)
#define RCC_AHB2ENR1_GPIOEEN_B_0X1          (0x1U<<4U)
#define RCC_AHB2ENR1_GPIODEN_B_0X0          (0x0U<<3U)
#define RCC_AHB2ENR1_GPIODEN_B_0X1          (0x1U<<3U)
#define RCC_AHB2ENR1_GPIOCEN_B_0X0          (0x0U<<2U)
#define RCC_AHB2ENR1_GPIOCEN_B_0X1          (0x1U<<2U)
#define RCC_AHB2ENR1_GPIOBEN_B_0X0          (0x0U<<1U)
#define RCC_AHB2ENR1_GPIOBEN_B_0X1          (0x1U<<1U)
#define RCC_AHB2ENR1_GPIOAEN_B_0X0          (0x0U<<0U)
#define RCC_AHB2ENR1_GPIOAEN_B_0X1          (0x1U<<0U)

