Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
// AHB2ENR2 Configuration

#define RCC_AHB2ENR2_SRAM5EN                (0x1U<<31U)
#define RCC_AHB2ENR2_SRAM6EN                (0x1U<<30U)
#define RCC_AHB2ENR2_HSPI1EN                (0x1U<<12U)
#define RCC_AHB2ENR2_OCTOSPI2EN             (0x1U<<8U)
#define RCC_AHB2ENR2_OCTOSPI1EN             (0x1U<<4U)
#define RCC_AHB2ENR2_FSMCEN                 (0x1U<<0U)
#define RCC_AHB2ENR2_SRAM5EN_B_0X0          (0x0U<<31U)
#define RCC_AHB2ENR2_SRAM5EN_B_0X1          (0x1U<<31U)
#define RCC_AHB2ENR2_SRAM6EN_B_0X0          (0x0U<<30U)
#define RCC_AHB2ENR2_SRAM6EN_B_0X1          (0x1U<<30U)
#define RCC_AHB2ENR2_HSPI1EN_B_0X0          (0x0U<<12U)
#define RCC_AHB2ENR2_HSPI1EN_B_0X1          (0x1U<<12U)
#define RCC_AHB2ENR2_OCTOSPI2EN_B_0X0       (0x0U<<8U)
#define RCC_AHB2ENR2_OCTOSPI2EN_B_0X1       (0x1U<<8U)
#define RCC_AHB2ENR2_OCTOSPI1EN_B_0X0       (0x0U<<4U)
#define RCC_AHB2ENR2_OCTOSPI1EN_B_0X1       (0x1U<<4U)
#define RCC_AHB2ENR2_FSMCEN_B_0X0           (0x0U<<0U)
#define RCC_AHB2ENR2_FSMCEN_B_0X1           (0x1U<<0U)

// AHB3ENR Configuration

#define RCC_AHB3ENR_SRAM4EN                 (0x1U<<31U)
#define RCC_AHB3ENR_GTZC2EN                 (0x1U<<12U)
#define RCC_AHB3ENR_ADF1EN                  (0x1U<<10U)
#define RCC_AHB3ENR_LPDMA1EN                (0x1U<<9U)
#define RCC_AHB3ENR_DAC1EN                  (0x1U<<6U)
#define RCC_AHB3ENR_ADC4EN                  (0x1U<<5U)
#define RCC_AHB3ENR_PWREN                   (0x1U<<2U)
#define RCC_AHB3ENR_LPGPIO1EN               (0x1U<<0U)
#define RCC_AHB3ENR_SRAM4EN_B_0X0           (0x0U<<31U)
#define RCC_AHB3ENR_SRAM4EN_B_0X1           (0x1U<<31U)
#define RCC_AHB3ENR_GTZC2EN_B_0X0           (0x0U<<12U)
#define RCC_AHB3ENR_GTZC2EN_B_0X1           (0x1U<<12U)
#define RCC_AHB3ENR_ADF1EN_B_0X0            (0x0U<<10U)
#define RCC_AHB3ENR_ADF1EN_B_0X1            (0x1U<<10U)
#define RCC_AHB3ENR_LPDMA1EN_B_0X0          (0x0U<<9U)
#define RCC_AHB3ENR_LPDMA1EN_B_0X1          (0x1U<<9U)
#define RCC_AHB3ENR_DAC1EN_B_0X0            (0x0U<<6U)
#define RCC_AHB3ENR_DAC1EN_B_0X1            (0x1U<<6U)
#define RCC_AHB3ENR_ADC4EN_B_0X0            (0x0U<<5U)
#define RCC_AHB3ENR_ADC4EN_B_0X1            (0x1U<<5U)
#define RCC_AHB3ENR_PWREN_B_0X0             (0x0U<<2U)
#define RCC_AHB3ENR_PWREN_B_0X1             (0x1U<<2U)
#define RCC_AHB3ENR_LPGPIO1EN_B_0X0         (0x0U<<0U)
#define RCC_AHB3ENR_LPGPIO1EN_B_0X1         (0x1U<<0U)

// APB1ENR1 Configuration

#define RCC_APB1ENR1_USART6EN               (0x1U<<25U)
#define RCC_APB1ENR1_CRSEN                  (0x1U<<24U)
#define RCC_APB1ENR1_I2C2EN                 (0x1U<<22U)
#define RCC_APB1ENR1_I2C1EN                 (0x1U<<21U)
#define RCC_APB1ENR1_UART5EN                (0x1U<<20U)
#define RCC_APB1ENR1_UART4EN                (0x1U<<19U)
#define RCC_APB1ENR1_USART3EN               (0x1U<<18U)
#define RCC_APB1ENR1_USART2EN               (0x1U<<17U)
#define RCC_APB1ENR1_SPI2EN                 (0x1U<<14U)
#define RCC_APB1ENR1_WWDGEN                 (0x1U<<11U)
#define RCC_APB1ENR1_TIM7EN                 (0x1U<<5U)
#define RCC_APB1ENR1_TIM6EN                 (0x1U<<4U)
#define RCC_APB1ENR1_TIM5EN                 (0x1U<<3U)
#define RCC_APB1ENR1_TIM4EN                 (0x1U<<2U)
#define RCC_APB1ENR1_TIM3EN                 (0x1U<<1U)
#define RCC_APB1ENR1_TIM2EN                 (0x1U<<0U)
#define RCC_APB1ENR1_USART6EN_B_0X0         (0x0U<<25U)
#define RCC_APB1ENR1_USART6EN_B_0X1         (0x1U<<25U)
#define RCC_APB1ENR1_CRSEN_B_0X0            (0x0U<<24U)
#define RCC_APB1ENR1_CRSEN_B_0X1            (0x1U<<24U)
#define RCC_APB1ENR1_I2C2EN_B_0X0           (0x0U<<22U)
#define RCC_APB1ENR1_I2C2EN_B_0X1           (0x1U<<22U)
#define RCC_APB1ENR1_I2C1EN_B_0X0           (0x0U<<21U)
#define RCC_APB1ENR1_I2C1EN_B_0X1           (0x1U<<21U)
#define RCC_APB1ENR1_UART5EN_B_0X0          (0x0U<<20U)
#define RCC_APB1ENR1_UART5EN_B_0X1          (0x1U<<20U)
#define RCC_APB1ENR1_UART4EN_B_0X0          (0x0U<<19U)
#define RCC_APB1ENR1_UART4EN_B_0X1          (0x1U<<19U)
#define RCC_APB1ENR1_USART3EN_B_0X0         (0x0U<<18U)
#define RCC_APB1ENR1_USART3EN_B_0X1         (0x1U<<18U)
#define RCC_APB1ENR1_USART2EN_B_0X0         (0x0U<<17U)
#define RCC_APB1ENR1_USART2EN_B_0X1         (0x1U<<17U)
#define RCC_APB1ENR1_SPI2EN_B_0X0           (0x0U<<14U)
#define RCC_APB1ENR1_SPI2EN_B_0X1           (0x1U<<14U)
#define RCC_APB1ENR1_WWDGEN_B_0X0           (0x0U<<11U)
#define RCC_APB1ENR1_WWDGEN_B_0X1           (0x1U<<11U)
#define RCC_APB1ENR1_TIM7EN_B_0X0           (0x0U<<5U)
#define RCC_APB1ENR1_TIM7EN_B_0X1           (0x1U<<5U)
#define RCC_APB1ENR1_TIM6EN_B_0X0           (0x0U<<4U)
#define RCC_APB1ENR1_TIM6EN_B_0X1           (0x1U<<4U)
#define RCC_APB1ENR1_TIM5EN_B_0X0           (0x0U<<3U)
#define RCC_APB1ENR1_TIM5EN_B_0X1           (0x1U<<3U)
#define RCC_APB1ENR1_TIM4EN_B_0X0           (0x0U<<2U)
#define RCC_APB1ENR1_TIM4EN_B_0X1           (0x1U<<2U)
#define RCC_APB1ENR1_TIM3EN_B_0X0           (0x0U<<1U)
#define RCC_APB1ENR1_TIM3EN_B_0X1           (0x1U<<1U)
#define RCC_APB1ENR1_TIM2EN_B_0X0           (0x0U<<0U)
#define RCC_APB1ENR1_TIM2EN_B_0X1           (0x1U<<0U)

// APB1ENR2 Configuration

#define RCC_APB1ENR2_UCPD1EN                (0x1U<<23U)
#define RCC_APB1ENR2_FDCAN1EN               (0x1U<<9U)
#define RCC_APB1ENR2_I2C6EN                 (0x1U<<7U)
#define RCC_APB1ENR2_I2C5EN                 (0x1U<<6U)
#define RCC_APB1ENR2_LPTIM2EN               (0x1U<<5U)
#define RCC_APB1ENR2_I2C4EN                 (0x1U<<1U)
#define RCC_APB1ENR2_UCPD1EN_B_0X0          (0x0U<<23U)
#define RCC_APB1ENR2_UCPD1EN_B_0X1          (0x1U<<23U)
#define RCC_APB1ENR2_FDCAN1EN_B_0X0         (0x0U<<9U)
#define RCC_APB1ENR2_FDCAN1EN_B_0X1         (0x1U<<9U)
#define RCC_APB1ENR2_I2C6EN_B_0X0           (0x0U<<7U)
#define RCC_APB1ENR2_I2C6EN_B_0X1           (0x1U<<7U)
#define RCC_APB1ENR2_I2C5EN_B_0X0           (0x0U<<6U)
#define RCC_APB1ENR2_I2C5EN_B_0X1           (0x1U<<6U)
#define RCC_APB1ENR2_LPTIM2EN_B_0X0         (0x0U<<5U)
#define RCC_APB1ENR2_LPTIM2EN_B_0X1         (0x1U<<5U)
#define RCC_APB1ENR2_I2C4EN_B_0X0           (0x0U<<1U)
#define RCC_APB1ENR2_I2C4EN_B_0X1           (0x1U<<1U)

