Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
// APB2ENR Configuration

#define RCC_APB2ENR_DSIEN                   (0x1U<<27U)
#define RCC_APB2ENR_LTDCEN                  (0x1U<<26U)
#define RCC_APB2ENR_GFXTIMEN                (0x1U<<25U)
#define RCC_APB2ENR_USBEN                   (0x1U<<24U)
#define RCC_APB2ENR_SAI2EN                  (0x1U<<22U)
#define RCC_APB2ENR_SAI1EN                  (0x1U<<21U)
#define RCC_APB2ENR_TIM17EN                 (0x1U<<18U)
#define RCC_APB2ENR_TIM16EN                 (0x1U<<17U)
#define RCC_APB2ENR_TIM15EN                 (0x1U<<16U)
#define RCC_APB2ENR_USART1EN                (0x1U<<14U)
#define RCC_APB2ENR_TIM8EN                  (0x1U<<13U)
#define RCC_APB2ENR_SPI1EN                  (0x1U<<12U)
#define RCC_APB2ENR_TIM1EN                  (0x1U<<11U)
#define RCC_APB2ENR_DSIEN_B_0X0             (0x0U<<27U)
#define RCC_APB2ENR_DSIEN_B_0X1             (0x1U<<27U)
#define RCC_APB2ENR_LTDCEN_B_0X0            (0x0U<<26U)
#define RCC_APB2ENR_LTDCEN_B_0X1            (0x1U<<26U)
#define RCC_APB2ENR_GFXTIMEN_B_0X0          (0x0U<<25U)
#define RCC_APB2ENR_GFXTIMEN_B_0X1          (0x1U<<25U)
#define RCC_APB2ENR_USBEN_B_0X0             (0x0U<<24U)
#define RCC_APB2ENR_USBEN_B_0X1             (0x1U<<24U)
#define RCC_APB2ENR_SAI2EN_B_0X0            (0x0U<<22U)
#define RCC_APB2ENR_SAI2EN_B_0X1            (0x1U<<22U)
#define RCC_APB2ENR_SAI1EN_B_0X0            (0x0U<<21U)
#define RCC_APB2ENR_SAI1EN_B_0X1            (0x1U<<21U)
#define RCC_APB2ENR_TIM17EN_B_0X0           (0x0U<<18U)
#define RCC_APB2ENR_TIM17EN_B_0X1           (0x1U<<18U)
#define RCC_APB2ENR_TIM16EN_B_0X0           (0x0U<<17U)
#define RCC_APB2ENR_TIM16EN_B_0X1           (0x1U<<17U)
#define RCC_APB2ENR_TIM15EN_B_0X0           (0x0U<<16U)
#define RCC_APB2ENR_TIM15EN_B_0X1           (0x1U<<16U)
#define RCC_APB2ENR_USART1EN_B_0X0          (0x0U<<14U)
#define RCC_APB2ENR_USART1EN_B_0X1          (0x1U<<14U)
#define RCC_APB2ENR_TIM8EN_B_0X0            (0x0U<<13U)
#define RCC_APB2ENR_TIM8EN_B_0X1            (0x1U<<13U)
#define RCC_APB2ENR_SPI1EN_B_0X0            (0x0U<<12U)
#define RCC_APB2ENR_SPI1EN_B_0X1            (0x1U<<12U)
#define RCC_APB2ENR_TIM1EN_B_0X0            (0x0U<<11U)
#define RCC_APB2ENR_TIM1EN_B_0X1            (0x1U<<11U)

// APB3ENR Configuration

#define RCC_APB3ENR_RTCAPBEN                (0x1U<<21U)
#define RCC_APB3ENR_VREFEN                  (0x1U<<20U)
#define RCC_APB3ENR_COMPEN                  (0x1U<<15U)
#define RCC_APB3ENR_OPAMPEN                 (0x1U<<14U)
#define RCC_APB3ENR_LPTIM4EN                (0x1U<<13U)
#define RCC_APB3ENR_LPTIM3EN                (0x1U<<12U)
#define RCC_APB3ENR_LPTIM1EN                (0x1U<<11U)
#define RCC_APB3ENR_I2C3EN                  (0x1U<<7U)
#define RCC_APB3ENR_LPUART1EN               (0x1U<<6U)
#define RCC_APB3ENR_SPI3EN                  (0x1U<<5U)
#define RCC_APB3ENR_SYSCFGEN                (0x1U<<1U)
#define RCC_APB3ENR_RTCAPBEN_B_0X0          (0x0U<<21U)
#define RCC_APB3ENR_RTCAPBEN_B_0X1          (0x1U<<21U)
#define RCC_APB3ENR_VREFEN_B_0X0            (0x0U<<20U)
#define RCC_APB3ENR_VREFEN_B_0X1            (0x1U<<20U)
#define RCC_APB3ENR_COMPEN_B_0X0            (0x0U<<15U)
#define RCC_APB3ENR_COMPEN_B_0X1            (0x1U<<15U)
#define RCC_APB3ENR_OPAMPEN_B_0X0           (0x0U<<14U)
#define RCC_APB3ENR_OPAMPEN_B_0X1           (0x1U<<14U)
#define RCC_APB3ENR_LPTIM4EN_B_0X0          (0x0U<<13U)
#define RCC_APB3ENR_LPTIM4EN_B_0X1          (0x1U<<13U)
#define RCC_APB3ENR_LPTIM3EN_B_0X0          (0x0U<<12U)
#define RCC_APB3ENR_LPTIM3EN_B_0X1          (0x1U<<12U)
#define RCC_APB3ENR_LPTIM1EN_B_0X0          (0x0U<<11U)
#define RCC_APB3ENR_LPTIM1EN_B_0X1          (0x1U<<11U)
#define RCC_APB3ENR_I2C3EN_B_0X0            (0x0U<<7U)
#define RCC_APB3ENR_I2C3EN_B_0X1            (0x1U<<7U)
#define RCC_APB3ENR_LPUART1EN_B_0X0         (0x0U<<6U)
#define RCC_APB3ENR_LPUART1EN_B_0X1         (0x1U<<6U)
#define RCC_APB3ENR_SPI3EN_B_0X0            (0x0U<<5U)
#define RCC_APB3ENR_SPI3EN_B_0X1            (0x1U<<5U)
#define RCC_APB3ENR_SYSCFGEN_B_0X0          (0x0U<<1U)
#define RCC_APB3ENR_SYSCFGEN_B_0X1          (0x1U<<1U)

// AHB1SMENR Configuration

#define RCC_AHB1SMENR_SRAM1SMEN             (0x1U<<31U)
#define RCC_AHB1SMENR_DCACHE1SMEN           (0x1U<<30U)
#define RCC_AHB1SMENR_ICACHESMEN            (0x1U<<29U)
#define RCC_AHB1SMENR_BKPSRAMSMEN           (0x1U<<28U)
#define RCC_AHB1SMENR_GTZC1SMEN             (0x1U<<24U)
#define RCC_AHB1SMENR_DCACHE2SMEN           (0x1U<<21U)
#define RCC_AHB1SMENR_GPU2DSMEN             (0x1U<<20U)
#define RCC_AHB1SMENR_GFXMMUSMEN            (0x1U<<19U)
#define RCC_AHB1SMENR_DMA2DSMEN             (0x1U<<18U)
#define RCC_AHB1SMENR_RAMCFGSMEN            (0x1U<<17U)
#define RCC_AHB1SMENR_TSCSMEN               (0x1U<<16U)
#define RCC_AHB1SMENR_JPEGSMEN              (0x1U<<15U)
#define RCC_AHB1SMENR_CRCSMEN               (0x1U<<12U)
#define RCC_AHB1SMENR_FLASHSMEN             (0x1U<<8U)
#define RCC_AHB1SMENR_MDF1SMEN              (0x1U<<3U)
#define RCC_AHB1SMENR_FMACSMEN              (0x1U<<2U)
#define RCC_AHB1SMENR_CORDICSMEN            (0x1U<<1U)
#define RCC_AHB1SMENR_GPDMA1SMEN            (0x1U<<0U)
#define RCC_AHB1SMENR_SRAM1SMEN_B_0X0       (0x0U<<31U)
#define RCC_AHB1SMENR_SRAM1SMEN_B_0X1       (0x1U<<31U)
#define RCC_AHB1SMENR_DCACHE1SMEN_B_0X0     (0x0U<<30U)
#define RCC_AHB1SMENR_DCACHE1SMEN_B_0X1     (0x1U<<30U)
#define RCC_AHB1SMENR_ICACHESMEN_B_0X0      (0x0U<<29U)
#define RCC_AHB1SMENR_ICACHESMEN_B_0X1      (0x1U<<29U)
#define RCC_AHB1SMENR_BKPSRAMSMEN_B_0X0     (0x0U<<28U)
#define RCC_AHB1SMENR_BKPSRAMSMEN_B_0X1     (0x1U<<28U)
#define RCC_AHB1SMENR_GTZC1SMEN_B_0X0       (0x0U<<24U)
#define RCC_AHB1SMENR_GTZC1SMEN_B_0X1       (0x1U<<24U)
#define RCC_AHB1SMENR_DCACHE2SMEN_B_0X0     (0x0U<<21U)
#define RCC_AHB1SMENR_DCACHE2SMEN_B_0X1     (0x1U<<21U)
#define RCC_AHB1SMENR_GPU2DSMEN_B_0X0       (0x0U<<20U)
#define RCC_AHB1SMENR_GPU2DSMEN_B_0X1       (0x1U<<20U)
#define RCC_AHB1SMENR_GFXMMUSMEN_B_0X0      (0x0U<<19U)
#define RCC_AHB1SMENR_GFXMMUSMEN_B_0X1      (0x1U<<19U)
#define RCC_AHB1SMENR_DMA2DSMEN_B_0X0       (0x0U<<18U)
#define RCC_AHB1SMENR_DMA2DSMEN_B_0X1       (0x1U<<18U)
#define RCC_AHB1SMENR_RAMCFGSMEN_B_0X0      (0x0U<<17U)
#define RCC_AHB1SMENR_RAMCFGSMEN_B_0X1      (0x1U<<17U)
#define RCC_AHB1SMENR_TSCSMEN_B_0X0         (0x0U<<16U)
#define RCC_AHB1SMENR_TSCSMEN_B_0X1         (0x1U<<16U)
#define RCC_AHB1SMENR_JPEGSMEN_B_0X0        (0x0U<<15U)
#define RCC_AHB1SMENR_JPEGSMEN_B_0X1        (0x1U<<15U)
#define RCC_AHB1SMENR_CRCSMEN_B_0X0         (0x0U<<12U)
#define RCC_AHB1SMENR_CRCSMEN_B_0X1         (0x1U<<12U)
#define RCC_AHB1SMENR_FLASHSMEN_B_0X0       (0x0U<<8U)
#define RCC_AHB1SMENR_FLASHSMEN_B_0X1       (0x1U<<8U)
#define RCC_AHB1SMENR_MDF1SMEN_B_0X0        (0x0U<<3U)
#define RCC_AHB1SMENR_MDF1SMEN_B_0X1        (0x1U<<3U)
#define RCC_AHB1SMENR_FMACSMEN_B_0X0        (0x0U<<2U)
#define RCC_AHB1SMENR_FMACSMEN_B_0X1        (0x1U<<2U)
#define RCC_AHB1SMENR_CORDICSMEN_B_0X0      (0x0U<<1U)
#define RCC_AHB1SMENR_CORDICSMEN_B_0X1      (0x1U<<1U)
#define RCC_AHB1SMENR_GPDMA1SMEN_B_0X0      (0x0U<<0U)
#define RCC_AHB1SMENR_GPDMA1SMEN_B_0X1      (0x1U<<0U)

// AHB2SMENR1 Configuration

#define RCC_AHB2SMENR1_SRAM3SMEN            (0x1U<<31U)
#define RCC_AHB2SMENR1_SRAM2SMEN            (0x1U<<30U)
#define RCC_AHB2SMENR1_SDMMC2SMEN           (0x1U<<28U)
#define RCC_AHB2SMENR1_SDMMC1SMEN           (0x1U<<27U)
#define RCC_AHB2SMENR1_OTFDEC2SMEN          (0x1U<<24U)
#define RCC_AHB2SMENR1_OTFDEC1SMEN          (0x1U<<23U)
#define RCC_AHB2SMENR1_OCTOSPIMSMEN         (0x1U<<21U)
#define RCC_AHB2SMENR1_SAESSMEN             (0x1U<<20U)
#define RCC_AHB2SMENR1_PKASMEN              (0x1U<<19U)
#define RCC_AHB2SMENR1_RNGSMEN              (0x1U<<18U)
#define RCC_AHB2SMENR1_HASHSMEN             (0x1U<<17U)
#define RCC_AHB2SMENR1_AESSMEN              (0x1U<<16U)
#define RCC_AHB2SMENR1_OTGHSPHYSMEN         (0x1U<<15U)
#define RCC_AHB2SMENR1_OTGSMEN              (0x1U<<14U)
#define RCC_AHB2SMENR1_DCMI_PSSISMEN        (0x1U<<12U)
#define RCC_AHB2SMENR1_ADC12SMEN            (0x1U<<10U)
#define RCC_AHB2SMENR1_GPIOJSMEN            (0x1U<<9U)
#define RCC_AHB2SMENR1_GPIOISMEN            (0x1U<<8U)
#define RCC_AHB2SMENR1_GPIOHSMEN            (0x1U<<7U)
#define RCC_AHB2SMENR1_GPIOGSMEN            (0x1U<<6U)
#define RCC_AHB2SMENR1_GPIOFSMEN            (0x1U<<5U)
#define RCC_AHB2SMENR1_GPIOESMEN            (0x1U<<4U)
#define RCC_AHB2SMENR1_GPIODSMEN            (0x1U<<3U)
#define RCC_AHB2SMENR1_GPIOCSMEN            (0x1U<<2U)
#define RCC_AHB2SMENR1_GPIOBSMEN            (0x1U<<1U)
#define RCC_AHB2SMENR1_GPIOASMEN            (0x1U<<0U)
#define RCC_AHB2SMENR1_SRAM3SMEN_B_0X0      (0x0U<<31U)
#define RCC_AHB2SMENR1_SRAM3SMEN_B_0X1      (0x1U<<31U)
#define RCC_AHB2SMENR1_SRAM2SMEN_B_0X0      (0x0U<<30U)
#define RCC_AHB2SMENR1_SRAM2SMEN_B_0X1      (0x1U<<30U)
#define RCC_AHB2SMENR1_SDMMC2SMEN_B_0X0     (0x0U<<28U)
#define RCC_AHB2SMENR1_SDMMC2SMEN_B_0X1     (0x1U<<28U)
#define RCC_AHB2SMENR1_SDMMC1SMEN_B_0X0     (0x0U<<27U)
#define RCC_AHB2SMENR1_SDMMC1SMEN_B_0X1     (0x1U<<27U)
#define RCC_AHB2SMENR1_OTFDEC2SMEN_B_0X0    (0x0U<<24U)
#define RCC_AHB2SMENR1_OTFDEC2SMEN_B_0X1    (0x1U<<24U)
#define RCC_AHB2SMENR1_OTFDEC1SMEN_B_0X0    (0x0U<<23U)
#define RCC_AHB2SMENR1_OTFDEC1SMEN_B_0X1    (0x1U<<23U)
#define RCC_AHB2SMENR1_OCTOSPIMSMEN_B_0X0   (0x0U<<21U)
#define RCC_AHB2SMENR1_OCTOSPIMSMEN_B_0X1   (0x1U<<21U)
#define RCC_AHB2SMENR1_SAESSMEN_B_0X0       (0x0U<<20U)
#define RCC_AHB2SMENR1_SAESSMEN_B_0X1       (0x1U<<20U)
#define RCC_AHB2SMENR1_PKASMEN_B_0X0        (0x0U<<19U)
#define RCC_AHB2SMENR1_PKASMEN_B_0X1        (0x1U<<19U)
#define RCC_AHB2SMENR1_RNGSMEN_B_0X0        (0x0U<<18U)
#define RCC_AHB2SMENR1_RNGSMEN_B_0X1        (0x1U<<18U)
#define RCC_AHB2SMENR1_HASHSMEN_B_0X0       (0x0U<<17U)
#define RCC_AHB2SMENR1_HASHSMEN_B_0X1       (0x1U<<17U)
#define RCC_AHB2SMENR1_AESSMEN_B_0X0        (0x0U<<16U)
#define RCC_AHB2SMENR1_AESSMEN_B_0X1        (0x1U<<16U)
#define RCC_AHB2SMENR1_OTGHSPHYSMEN_B_0X0   (0x0U<<15U)
#define RCC_AHB2SMENR1_OTGHSPHYSMEN_B_0X1   (0x1U<<15U)
#define RCC_AHB2SMENR1_OTGSMEN_B_0X0        (0x0U<<14U)
#define RCC_AHB2SMENR1_OTGSMEN_B_0X1        (0x1U<<14U)
#define RCC_AHB2SMENR1_DCMI_PSSISMEN_B_0X0  (0x0U<<12U)
#define RCC_AHB2SMENR1_DCMI_PSSISMEN_B_0X1  (0x1U<<12U)
#define RCC_AHB2SMENR1_ADC12SMEN_B_0X0      (0x0U<<10U)
#define RCC_AHB2SMENR1_ADC12SMEN_B_0X1      (0x1U<<10U)
#define RCC_AHB2SMENR1_GPIOJSMEN_B_0X0      (0x0U<<9U)
#define RCC_AHB2SMENR1_GPIOJSMEN_B_0X1      (0x1U<<9U)
#define RCC_AHB2SMENR1_GPIOISMEN_B_0X0      (0x0U<<8U)
#define RCC_AHB2SMENR1_GPIOISMEN_B_0X1      (0x1U<<8U)
#define RCC_AHB2SMENR1_GPIOHSMEN_B_0X0      (0x0U<<7U)
#define RCC_AHB2SMENR1_GPIOHSMEN_B_0X1      (0x1U<<7U)
#define RCC_AHB2SMENR1_GPIOGSMEN_B_0X0      (0x0U<<6U)
#define RCC_AHB2SMENR1_GPIOGSMEN_B_0X1      (0x1U<<6U)
#define RCC_AHB2SMENR1_GPIOFSMEN_B_0X0      (0x0U<<5U)
#define RCC_AHB2SMENR1_GPIOFSMEN_B_0X1      (0x1U<<5U)
#define RCC_AHB2SMENR1_GPIOESMEN_B_0X0      (0x0U<<4U)
#define RCC_AHB2SMENR1_GPIOESMEN_B_0X1      (0x1U<<4U)
#define RCC_AHB2SMENR1_GPIODSMEN_B_0X0      (0x0U<<3U)
#define RCC_AHB2SMENR1_GPIODSMEN_B_0X1      (0x1U<<3U)
#define RCC_AHB2SMENR1_GPIOCSMEN_B_0X0      (0x0U<<2U)
#define RCC_AHB2SMENR1_GPIOCSMEN_B_0X1      (0x1U<<2U)
#define RCC_AHB2SMENR1_GPIOBSMEN_B_0X0      (0x0U<<1U)
#define RCC_AHB2SMENR1_GPIOBSMEN_B_0X1      (0x1U<<1U)
#define RCC_AHB2SMENR1_GPIOASMEN_B_0X0      (0x0U<<0U)
#define RCC_AHB2SMENR1_GPIOASMEN_B_0X1      (0x1U<<0U)

