Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
// AHB2SMENR2 Configuration

#define RCC_AHB2SMENR2_SRAM5SMEN            (0x1U<<31U)
#define RCC_AHB2SMENR2_SRAM6SMEN            (0x1U<<30U)
#define RCC_AHB2SMENR2_HSPI1SMEN            (0x1U<<12U)
#define RCC_AHB2SMENR2_OCTOSPI2SMEN         (0x1U<<8U)
#define RCC_AHB2SMENR2_OCTOSPI1SMEN         (0x1U<<4U)
#define RCC_AHB2SMENR2_FSMCSMEN             (0x1U<<0U)
#define RCC_AHB2SMENR2_SRAM5SMEN_B_0X0      (0x0U<<31U)
#define RCC_AHB2SMENR2_SRAM5SMEN_B_0X1      (0x1U<<31U)
#define RCC_AHB2SMENR2_SRAM6SMEN_B_0X0      (0x0U<<30U)
#define RCC_AHB2SMENR2_SRAM6SMEN_B_0X1      (0x1U<<30U)
#define RCC_AHB2SMENR2_HSPI1SMEN_B_0X0      (0x0U<<12U)
#define RCC_AHB2SMENR2_HSPI1SMEN_B_0X1      (0x1U<<12U)
#define RCC_AHB2SMENR2_OCTOSPI2SMEN_B_0X0   (0x0U<<8U)
#define RCC_AHB2SMENR2_OCTOSPI2SMEN_B_0X1   (0x1U<<8U)
#define RCC_AHB2SMENR2_OCTOSPI1SMEN_B_0X0   (0x0U<<4U)
#define RCC_AHB2SMENR2_OCTOSPI1SMEN_B_0X1   (0x1U<<4U)
#define RCC_AHB2SMENR2_FSMCSMEN_B_0X0       (0x0U<<0U)
#define RCC_AHB2SMENR2_FSMCSMEN_B_0X1       (0x1U<<0U)

// AHB3SMENR Configuration

#define RCC_AHB3SMENR_SRAM4SMEN             (0x1U<<31U)
#define RCC_AHB3SMENR_GTZC2SMEN             (0x1U<<12U)
#define RCC_AHB3SMENR_ADF1SMEN              (0x1U<<10U)
#define RCC_AHB3SMENR_LPDMA1SMEN            (0x1U<<9U)
#define RCC_AHB3SMENR_DAC1SMEN              (0x1U<<6U)
#define RCC_AHB3SMENR_ADC4SMEN              (0x1U<<5U)
#define RCC_AHB3SMENR_PWRSMEN               (0x1U<<2U)
#define RCC_AHB3SMENR_LPGPIO1SMEN           (0x1U<<0U)
#define RCC_AHB3SMENR_SRAM4SMEN_B_0X0       (0x0U<<31U)
#define RCC_AHB3SMENR_SRAM4SMEN_B_0X1       (0x1U<<31U)
#define RCC_AHB3SMENR_GTZC2SMEN_B_0X0       (0x0U<<12U)
#define RCC_AHB3SMENR_GTZC2SMEN_B_0X1       (0x1U<<12U)
#define RCC_AHB3SMENR_ADF1SMEN_B_0X0        (0x0U<<10U)
#define RCC_AHB3SMENR_ADF1SMEN_B_0X1        (0x1U<<10U)
#define RCC_AHB3SMENR_LPDMA1SMEN_B_0X0      (0x0U<<9U)
#define RCC_AHB3SMENR_LPDMA1SMEN_B_0X1      (0x1U<<9U)
#define RCC_AHB3SMENR_DAC1SMEN_B_0X0        (0x0U<<6U)
#define RCC_AHB3SMENR_DAC1SMEN_B_0X1        (0x1U<<6U)
#define RCC_AHB3SMENR_ADC4SMEN_B_0X0        (0x0U<<5U)
#define RCC_AHB3SMENR_ADC4SMEN_B_0X1        (0x1U<<5U)
#define RCC_AHB3SMENR_PWRSMEN_B_0X0         (0x0U<<2U)
#define RCC_AHB3SMENR_PWRSMEN_B_0X1         (0x1U<<2U)
#define RCC_AHB3SMENR_LPGPIO1SMEN_B_0X0     (0x0U<<0U)
#define RCC_AHB3SMENR_LPGPIO1SMEN_B_0X1     (0x1U<<0U)

// APB1SMENR1 Configuration

#define RCC_APB1SMENR1_USART6SMEN           (0x1U<<25U)
#define RCC_APB1SMENR1_CRSSMEN              (0x1U<<24U)
#define RCC_APB1SMENR1_I2C2SMEN             (0x1U<<22U)
#define RCC_APB1SMENR1_I2C1SMEN             (0x1U<<21U)
#define RCC_APB1SMENR1_UART5SMEN            (0x1U<<20U)
#define RCC_APB1SMENR1_UART4SMEN            (0x1U<<19U)
#define RCC_APB1SMENR1_USART3SMEN           (0x1U<<18U)
#define RCC_APB1SMENR1_USART2SMEN           (0x1U<<17U)
#define RCC_APB1SMENR1_SPI2SMEN             (0x1U<<14U)
#define RCC_APB1SMENR1_WWDGSMEN             (0x1U<<11U)
#define RCC_APB1SMENR1_TIM7SMEN             (0x1U<<5U)
#define RCC_APB1SMENR1_TIM6SMEN             (0x1U<<4U)
#define RCC_APB1SMENR1_TIM5SMEN             (0x1U<<3U)
#define RCC_APB1SMENR1_TIM4SMEN             (0x1U<<2U)
#define RCC_APB1SMENR1_TIM3SMEN             (0x1U<<1U)
#define RCC_APB1SMENR1_TIM2SMEN             (0x1U<<0U)
#define RCC_APB1SMENR1_USART6SMEN_B_0X0     (0x0U<<25U)
#define RCC_APB1SMENR1_USART6SMEN_B_0X1     (0x1U<<25U)
#define RCC_APB1SMENR1_CRSSMEN_B_0X0        (0x0U<<24U)
#define RCC_APB1SMENR1_CRSSMEN_B_0X1        (0x1U<<24U)
#define RCC_APB1SMENR1_I2C2SMEN_B_0X0       (0x0U<<22U)
#define RCC_APB1SMENR1_I2C2SMEN_B_0X1       (0x1U<<22U)
#define RCC_APB1SMENR1_I2C1SMEN_B_0X0       (0x0U<<21U)
#define RCC_APB1SMENR1_I2C1SMEN_B_0X1       (0x1U<<21U)
#define RCC_APB1SMENR1_UART5SMEN_B_0X0      (0x0U<<20U)
#define RCC_APB1SMENR1_UART5SMEN_B_0X1      (0x1U<<20U)
#define RCC_APB1SMENR1_UART4SMEN_B_0X0      (0x0U<<19U)
#define RCC_APB1SMENR1_UART4SMEN_B_0X1      (0x1U<<19U)
#define RCC_APB1SMENR1_USART3SMEN_B_0X0     (0x0U<<18U)
#define RCC_APB1SMENR1_USART3SMEN_B_0X1     (0x1U<<18U)
#define RCC_APB1SMENR1_USART2SMEN_B_0X0     (0x0U<<17U)
#define RCC_APB1SMENR1_USART2SMEN_B_0X1     (0x1U<<17U)
#define RCC_APB1SMENR1_SPI2SMEN_B_0X0       (0x0U<<14U)
#define RCC_APB1SMENR1_SPI2SMEN_B_0X1       (0x1U<<14U)
#define RCC_APB1SMENR1_WWDGSMEN_B_0X0       (0x0U<<11U)
#define RCC_APB1SMENR1_WWDGSMEN_B_0X1       (0x1U<<11U)
#define RCC_APB1SMENR1_TIM7SMEN_B_0X0       (0x0U<<5U)
#define RCC_APB1SMENR1_TIM7SMEN_B_0X1       (0x1U<<5U)
#define RCC_APB1SMENR1_TIM6SMEN_B_0X0       (0x0U<<4U)
#define RCC_APB1SMENR1_TIM6SMEN_B_0X1       (0x1U<<4U)
#define RCC_APB1SMENR1_TIM5SMEN_B_0X0       (0x0U<<3U)
#define RCC_APB1SMENR1_TIM5SMEN_B_0X1       (0x1U<<3U)
#define RCC_APB1SMENR1_TIM4SMEN_B_0X0       (0x0U<<2U)
#define RCC_APB1SMENR1_TIM4SMEN_B_0X1       (0x1U<<2U)
#define RCC_APB1SMENR1_TIM3SMEN_B_0X0       (0x0U<<1U)
#define RCC_APB1SMENR1_TIM3SMEN_B_0X1       (0x1U<<1U)
#define RCC_APB1SMENR1_TIM2SMEN_B_0X0       (0x0U<<0U)
#define RCC_APB1SMENR1_TIM2SMEN_B_0X1       (0x1U<<0U)

// APB1SMENR2 Configuration

#define RCC_APB1SMENR2_UCPD1SMEN            (0x1U<<23U)
#define RCC_APB1SMENR2_FDCAN1SMEN           (0x1U<<9U)
#define RCC_APB1SMENR2_I2C6SMEN             (0x1U<<7U)
#define RCC_APB1SMENR2_I2C5SMEN             (0x1U<<6U)
#define RCC_APB1SMENR2_LPTIM2SMEN           (0x1U<<5U)
#define RCC_APB1SMENR2_I2C4SMEN             (0x1U<<1U)
#define RCC_APB1SMENR2_UCPD1SMEN_B_0X0      (0x0U<<23U)
#define RCC_APB1SMENR2_UCPD1SMEN_B_0X1      (0x1U<<23U)
#define RCC_APB1SMENR2_FDCAN1SMEN_B_0X0     (0x0U<<9U)
#define RCC_APB1SMENR2_FDCAN1SMEN_B_0X1     (0x1U<<9U)
#define RCC_APB1SMENR2_I2C6SMEN_B_0X0       (0x0U<<7U)
#define RCC_APB1SMENR2_I2C6SMEN_B_0X1       (0x1U<<7U)
#define RCC_APB1SMENR2_I2C5SMEN_B_0X0       (0x0U<<6U)
#define RCC_APB1SMENR2_I2C5SMEN_B_0X1       (0x1U<<6U)
#define RCC_APB1SMENR2_LPTIM2SMEN_B_0X0     (0x0U<<5U)
#define RCC_APB1SMENR2_LPTIM2SMEN_B_0X1     (0x1U<<5U)
#define RCC_APB1SMENR2_I2C4SMEN_B_0X0       (0x0U<<1U)
#define RCC_APB1SMENR2_I2C4SMEN_B_0X1       (0x1U<<1U)

// APB2SMENR Configuration

