Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
#define RCC_APB2SMENR_DSISMEN               (0x1U<<27U)
#define RCC_APB2SMENR_LTDCSMEN              (0x1U<<26U)
#define RCC_APB2SMENR_GFXTIMSMEN            (0x1U<<25U)
#define RCC_APB2SMENR_USBSMEN               (0x1U<<24U)
#define RCC_APB2SMENR_SAI2SMEN              (0x1U<<22U)
#define RCC_APB2SMENR_SAI1SMEN              (0x1U<<21U)
#define RCC_APB2SMENR_TIM17SMEN             (0x1U<<18U)
#define RCC_APB2SMENR_TIM16SMEN             (0x1U<<17U)
#define RCC_APB2SMENR_TIM15SMEN             (0x1U<<16U)
#define RCC_APB2SMENR_USART1SMEN            (0x1U<<14U)
#define RCC_APB2SMENR_TIM8SMEN              (0x1U<<13U)
#define RCC_APB2SMENR_SPI1SMEN              (0x1U<<12U)
#define RCC_APB2SMENR_TIM1SMEN              (0x1U<<11U)
#define RCC_APB2SMENR_DSISMEN_B_0X0         (0x0U<<27U)
#define RCC_APB2SMENR_DSISMEN_B_0X1         (0x1U<<27U)
#define RCC_APB2SMENR_LTDCSMEN_B_0X0        (0x0U<<26U)
#define RCC_APB2SMENR_LTDCSMEN_B_0X1        (0x1U<<26U)
#define RCC_APB2SMENR_GFXTIMSMEN_B_0X0      (0x0U<<25U)
#define RCC_APB2SMENR_GFXTIMSMEN_B_0X1      (0x1U<<25U)
#define RCC_APB2SMENR_USBSMEN_B_0X0         (0x0U<<24U)
#define RCC_APB2SMENR_USBSMEN_B_0X1         (0x1U<<24U)
#define RCC_APB2SMENR_SAI2SMEN_B_0X0        (0x0U<<22U)
#define RCC_APB2SMENR_SAI2SMEN_B_0X1        (0x1U<<22U)
#define RCC_APB2SMENR_SAI1SMEN_B_0X0        (0x0U<<21U)
#define RCC_APB2SMENR_SAI1SMEN_B_0X1        (0x1U<<21U)
#define RCC_APB2SMENR_TIM17SMEN_B_0X0       (0x0U<<18U)
#define RCC_APB2SMENR_TIM17SMEN_B_0X1       (0x1U<<18U)
#define RCC_APB2SMENR_TIM16SMEN_B_0X0       (0x0U<<17U)
#define RCC_APB2SMENR_TIM16SMEN_B_0X1       (0x1U<<17U)
#define RCC_APB2SMENR_TIM15SMEN_B_0X0       (0x0U<<16U)
#define RCC_APB2SMENR_TIM15SMEN_B_0X1       (0x1U<<16U)
#define RCC_APB2SMENR_USART1SMEN_B_0X0      (0x0U<<14U)
#define RCC_APB2SMENR_USART1SMEN_B_0X1      (0x1U<<14U)
#define RCC_APB2SMENR_TIM8SMEN_B_0X0        (0x0U<<13U)
#define RCC_APB2SMENR_TIM8SMEN_B_0X1        (0x1U<<13U)
#define RCC_APB2SMENR_SPI1SMEN_B_0X0        (0x0U<<12U)
#define RCC_APB2SMENR_SPI1SMEN_B_0X1        (0x1U<<12U)
#define RCC_APB2SMENR_TIM1SMEN_B_0X0        (0x0U<<11U)
#define RCC_APB2SMENR_TIM1SMEN_B_0X1        (0x1U<<11U)

// APB3SMENR Configuration

#define RCC_APB3SMENR_RTCAPBSMEN            (0x1U<<21U)
#define RCC_APB3SMENR_VREFSMEN              (0x1U<<20U)
#define RCC_APB3SMENR_COMPSMEN              (0x1U<<15U)
#define RCC_APB3SMENR_OPAMPSMEN             (0x1U<<14U)
#define RCC_APB3SMENR_LPTIM4SMEN            (0x1U<<13U)
#define RCC_APB3SMENR_LPTIM3SMEN            (0x1U<<12U)
#define RCC_APB3SMENR_LPTIM1SMEN            (0x1U<<11U)
#define RCC_APB3SMENR_I2C3SMEN              (0x1U<<7U)
#define RCC_APB3SMENR_LPUART1SMEN           (0x1U<<6U)
#define RCC_APB3SMENR_SPI3SMEN              (0x1U<<5U)
#define RCC_APB3SMENR_SYSCFGSMEN            (0x1U<<1U)
#define RCC_APB3SMENR_RTCAPBSMEN_B_0X0      (0x0U<<21U)
#define RCC_APB3SMENR_RTCAPBSMEN_B_0X1      (0x1U<<21U)
#define RCC_APB3SMENR_VREFSMEN_B_0X0        (0x0U<<20U)
#define RCC_APB3SMENR_VREFSMEN_B_0X1        (0x1U<<20U)
#define RCC_APB3SMENR_COMPSMEN_B_0X0        (0x0U<<15U)
#define RCC_APB3SMENR_COMPSMEN_B_0X1        (0x1U<<15U)
#define RCC_APB3SMENR_OPAMPSMEN_B_0X0       (0x0U<<14U)
#define RCC_APB3SMENR_OPAMPSMEN_B_0X1       (0x1U<<14U)
#define RCC_APB3SMENR_LPTIM4SMEN_B_0X0      (0x0U<<13U)
#define RCC_APB3SMENR_LPTIM4SMEN_B_0X1      (0x1U<<13U)
#define RCC_APB3SMENR_LPTIM3SMEN_B_0X0      (0x0U<<12U)
#define RCC_APB3SMENR_LPTIM3SMEN_B_0X1      (0x1U<<12U)
#define RCC_APB3SMENR_LPTIM1SMEN_B_0X0      (0x0U<<11U)
#define RCC_APB3SMENR_LPTIM1SMEN_B_0X1      (0x1U<<11U)
#define RCC_APB3SMENR_I2C3SMEN_B_0X0        (0x0U<<7U)
#define RCC_APB3SMENR_I2C3SMEN_B_0X1        (0x1U<<7U)
#define RCC_APB3SMENR_LPUART1SMEN_B_0X0     (0x0U<<6U)
#define RCC_APB3SMENR_LPUART1SMEN_B_0X1     (0x1U<<6U)
#define RCC_APB3SMENR_SPI3SMEN_B_0X0        (0x0U<<5U)
#define RCC_APB3SMENR_SPI3SMEN_B_0X1        (0x1U<<5U)
#define RCC_APB3SMENR_SYSCFGSMEN_B_0X0      (0x0U<<1U)
#define RCC_APB3SMENR_SYSCFGSMEN_B_0X1      (0x1U<<1U)

// SRDAMR Configuration

#define RCC_SRDAMR_SRAM4AMEN                (0x1U<<31U)
#define RCC_SRDAMR_ADF1AMEN                 (0x1U<<29U)
#define RCC_SRDAMR_LPDMA1AMEN               (0x1U<<28U)
#define RCC_SRDAMR_DAC1AMEN                 (0x1U<<27U)
#define RCC_SRDAMR_LPGPIO1AMEN              (0x1U<<26U)
#define RCC_SRDAMR_ADC4AMEN                 (0x1U<<25U)
#define RCC_SRDAMR_RTCAPBAMEN               (0x1U<<21U)
#define RCC_SRDAMR_VREFAMEN                 (0x1U<<20U)
#define RCC_SRDAMR_COMPAMEN                 (0x1U<<15U)
#define RCC_SRDAMR_OPAMPAMEN                (0x1U<<14U)
#define RCC_SRDAMR_LPTIM4AMEN               (0x1U<<13U)
#define RCC_SRDAMR_LPTIM3AMEN               (0x1U<<12U)
#define RCC_SRDAMR_LPTIM1AMEN               (0x1U<<11U)
#define RCC_SRDAMR_I2C3AMEN                 (0x1U<<7U)
#define RCC_SRDAMR_LPUART1AMEN              (0x1U<<6U)
#define RCC_SRDAMR_SPI3AMEN                 (0x1U<<5U)
#define RCC_SRDAMR_SRAM4AMEN_B_0X0          (0x0U<<31U)
#define RCC_SRDAMR_SRAM4AMEN_B_0X1          (0x1U<<31U)
#define RCC_SRDAMR_ADF1AMEN_B_0X0           (0x0U<<29U)
#define RCC_SRDAMR_ADF1AMEN_B_0X1           (0x1U<<29U)
#define RCC_SRDAMR_LPDMA1AMEN_B_0X0         (0x0U<<28U)
#define RCC_SRDAMR_LPDMA1AMEN_B_0X1         (0x1U<<28U)
#define RCC_SRDAMR_DAC1AMEN_B_0X0           (0x0U<<27U)
#define RCC_SRDAMR_DAC1AMEN_B_0X1           (0x1U<<27U)
#define RCC_SRDAMR_LPGPIO1AMEN_B_0X0        (0x0U<<26U)
#define RCC_SRDAMR_LPGPIO1AMEN_B_0X1        (0x1U<<26U)
#define RCC_SRDAMR_ADC4AMEN_B_0X0           (0x0U<<25U)
#define RCC_SRDAMR_ADC4AMEN_B_0X1           (0x1U<<25U)
#define RCC_SRDAMR_RTCAPBAMEN_B_0X0         (0x0U<<21U)
#define RCC_SRDAMR_RTCAPBAMEN_B_0X1         (0x1U<<21U)
#define RCC_SRDAMR_VREFAMEN_B_0X0           (0x0U<<20U)
#define RCC_SRDAMR_VREFAMEN_B_0X1           (0x1U<<20U)
#define RCC_SRDAMR_COMPAMEN_B_0X0           (0x0U<<15U)
#define RCC_SRDAMR_COMPAMEN_B_0X1           (0x1U<<15U)
#define RCC_SRDAMR_OPAMPAMEN_B_0X0          (0x0U<<14U)
#define RCC_SRDAMR_OPAMPAMEN_B_0X1          (0x1U<<14U)
#define RCC_SRDAMR_LPTIM4AMEN_B_0X0         (0x0U<<13U)
#define RCC_SRDAMR_LPTIM4AMEN_B_0X1         (0x1U<<13U)
#define RCC_SRDAMR_LPTIM3AMEN_B_0X0         (0x0U<<12U)
#define RCC_SRDAMR_LPTIM3AMEN_B_0X1         (0x1U<<12U)
#define RCC_SRDAMR_LPTIM1AMEN_B_0X0         (0x0U<<11U)
#define RCC_SRDAMR_LPTIM1AMEN_B_0X1         (0x1U<<11U)
#define RCC_SRDAMR_I2C3AMEN_B_0X0           (0x0U<<7U)
#define RCC_SRDAMR_I2C3AMEN_B_0X1           (0x1U<<7U)
#define RCC_SRDAMR_LPUART1AMEN_B_0X0        (0x0U<<6U)
#define RCC_SRDAMR_LPUART1AMEN_B_0X1        (0x1U<<6U)
#define RCC_SRDAMR_SPI3AMEN_B_0X0           (0x0U<<5U)
#define RCC_SRDAMR_SPI3AMEN_B_0X1           (0x1U<<5U)

