Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
// CCIPR1 Configuration

#define RCC_CCIPR1_TIMICSEL                 (0x7U<<29U)
#define RCC_CCIPR1_TIMICSEL_0               (0x1U<<29U)
#define RCC_CCIPR1_ICLKSEL                  (0x3U<<26U)
#define RCC_CCIPR1_ICLKSEL_0                (0x1U<<26U)
#define RCC_CCIPR1_FDCAN1SEL                (0x3U<<24U)
#define RCC_CCIPR1_FDCAN1SEL_0              (0x1U<<24U)
#define RCC_CCIPR1_SYSTICKSEL               (0x3U<<22U)
#define RCC_CCIPR1_SYSTICKSEL_0             (0x1U<<22U)
#define RCC_CCIPR1_SPI1SEL                  (0x3U<<20U)
#define RCC_CCIPR1_SPI1SEL_0                (0x1U<<20U)
#define RCC_CCIPR1_LPTIM2SEL                (0x3U<<18U)
#define RCC_CCIPR1_LPTIM2SEL_0              (0x1U<<18U)
#define RCC_CCIPR1_SPI2SEL                  (0x3U<<16U)
#define RCC_CCIPR1_SPI2SEL_0                (0x1U<<16U)
#define RCC_CCIPR1_I2C4SEL                  (0x3U<<14U)
#define RCC_CCIPR1_I2C4SEL_0                (0x1U<<14U)
#define RCC_CCIPR1_I2C2SEL                  (0x3U<<12U)
#define RCC_CCIPR1_I2C2SEL_0                (0x1U<<12U)
#define RCC_CCIPR1_I2C1SEL                  (0x3U<<10U)
#define RCC_CCIPR1_I2C1SEL_0                (0x1U<<10U)
#define RCC_CCIPR1_UART5SEL                 (0x3U<<8U)
#define RCC_CCIPR1_UART5SEL_0               (0x1U<<8U)
#define RCC_CCIPR1_UART4SEL                 (0x3U<<6U)
#define RCC_CCIPR1_UART4SEL_0               (0x1U<<6U)
#define RCC_CCIPR1_USART3SEL                (0x3U<<4U)
#define RCC_CCIPR1_USART3SEL_0              (0x1U<<4U)
#define RCC_CCIPR1_USART2SEL                (0x3U<<2U)
#define RCC_CCIPR1_USART2SEL_0              (0x1U<<2U)
#define RCC_CCIPR1_USART1SEL                (0x3U<<0U)
#define RCC_CCIPR1_USART1SEL_0              (0x1U<<0U)
#define RCC_CCIPR1_TIMICSEL_B_0X4           (0x4U<<29U)
#define RCC_CCIPR1_TIMICSEL_B_0X5           (0x5U<<29U)
#define RCC_CCIPR1_TIMICSEL_B_0X6           (0x6U<<29U)
#define RCC_CCIPR1_TIMICSEL_B_0X7           (0x7U<<29U)
#define RCC_CCIPR1_ICLKSEL_B_0X0            (0x0U<<26U)
#define RCC_CCIPR1_ICLKSEL_B_0X1            (0x1U<<26U)
#define RCC_CCIPR1_ICLKSEL_B_0X2            (0x2U<<26U)
#define RCC_CCIPR1_ICLKSEL_B_0X3            (0x3U<<26U)
#define RCC_CCIPR1_FDCAN1SEL_B_0X0          (0x0U<<24U)
#define RCC_CCIPR1_FDCAN1SEL_B_0X1          (0x1U<<24U)
#define RCC_CCIPR1_FDCAN1SEL_B_0X2          (0x2U<<24U)
#define RCC_CCIPR1_FDCAN1SEL_B_0X3          (0x3U<<24U)
#define RCC_CCIPR1_SYSTICKSEL_B_0X0         (0x0U<<22U)
#define RCC_CCIPR1_SYSTICKSEL_B_0X1         (0x1U<<22U)
#define RCC_CCIPR1_SYSTICKSEL_B_0X2         (0x2U<<22U)
#define RCC_CCIPR1_SYSTICKSEL_B_0X3         (0x3U<<22U)
#define RCC_CCIPR1_SPI1SEL_B_0X0            (0x0U<<20U)
#define RCC_CCIPR1_SPI1SEL_B_0X1            (0x1U<<20U)
#define RCC_CCIPR1_SPI1SEL_B_0X2            (0x2U<<20U)
#define RCC_CCIPR1_SPI1SEL_B_0X3            (0x3U<<20U)
#define RCC_CCIPR1_LPTIM2SEL_B_0X0          (0x0U<<18U)
#define RCC_CCIPR1_LPTIM2SEL_B_0X1          (0x1U<<18U)
#define RCC_CCIPR1_LPTIM2SEL_B_0X2          (0x2U<<18U)
#define RCC_CCIPR1_LPTIM2SEL_B_0X3          (0x3U<<18U)
#define RCC_CCIPR1_SPI2SEL_B_0X0            (0x0U<<16U)
#define RCC_CCIPR1_SPI2SEL_B_0X1            (0x1U<<16U)
#define RCC_CCIPR1_SPI2SEL_B_0X2            (0x2U<<16U)
#define RCC_CCIPR1_SPI2SEL_B_0X3            (0x3U<<16U)
#define RCC_CCIPR1_I2C4SEL_B_0X0            (0x0U<<14U)
#define RCC_CCIPR1_I2C4SEL_B_0X1            (0x1U<<14U)
#define RCC_CCIPR1_I2C4SEL_B_0X2            (0x2U<<14U)
#define RCC_CCIPR1_I2C4SEL_B_0X3            (0x3U<<14U)
#define RCC_CCIPR1_I2C2SEL_B_0X0            (0x0U<<12U)
#define RCC_CCIPR1_I2C2SEL_B_0X1            (0x1U<<12U)
#define RCC_CCIPR1_I2C2SEL_B_0X2            (0x2U<<12U)
#define RCC_CCIPR1_I2C2SEL_B_0X3            (0x3U<<12U)
#define RCC_CCIPR1_I2C1SEL_B_0X0            (0x0U<<10U)
#define RCC_CCIPR1_I2C1SEL_B_0X1            (0x1U<<10U)
#define RCC_CCIPR1_I2C1SEL_B_0X2            (0x2U<<10U)
#define RCC_CCIPR1_I2C1SEL_B_0X3            (0x3U<<10U)
#define RCC_CCIPR1_UART5SEL_B_0X0           (0x0U<<8U)
#define RCC_CCIPR1_UART5SEL_B_0X1           (0x1U<<8U)
#define RCC_CCIPR1_UART5SEL_B_0X2           (0x2U<<8U)
#define RCC_CCIPR1_UART5SEL_B_0X3           (0x3U<<8U)
#define RCC_CCIPR1_UART4SEL_B_0X0           (0x0U<<6U)
#define RCC_CCIPR1_UART4SEL_B_0X1           (0x1U<<6U)
#define RCC_CCIPR1_UART4SEL_B_0X2           (0x2U<<6U)
#define RCC_CCIPR1_UART4SEL_B_0X3           (0x3U<<6U)
#define RCC_CCIPR1_USART3SEL_B_0X0          (0x0U<<4U)
#define RCC_CCIPR1_USART3SEL_B_0X1          (0x1U<<4U)
#define RCC_CCIPR1_USART3SEL_B_0X2          (0x2U<<4U)
#define RCC_CCIPR1_USART3SEL_B_0X3          (0x3U<<4U)
#define RCC_CCIPR1_USART2SEL_B_0X0          (0x0U<<2U)
#define RCC_CCIPR1_USART2SEL_B_0X1          (0x1U<<2U)
#define RCC_CCIPR1_USART2SEL_B_0X2          (0x2U<<2U)
#define RCC_CCIPR1_USART2SEL_B_0X3          (0x3U<<2U)
#define RCC_CCIPR1_USART1SEL_B_0X0          (0x0U<<0U)
#define RCC_CCIPR1_USART1SEL_B_0X1          (0x1U<<0U)
#define RCC_CCIPR1_USART1SEL_B_0X2          (0x2U<<0U)
#define RCC_CCIPR1_USART1SEL_B_0X3          (0x3U<<0U)

// CCIPR2 Configuration

#define RCC_CCIPR2_OTGHSSEL                 (0x3U<<30U)
#define RCC_CCIPR2_OTGHSSEL_0               (0x1U<<30U)
#define RCC_CCIPR2_I2C6SEL                  (0x3U<<26U)
#define RCC_CCIPR2_I2C6SEL_0                (0x1U<<26U)
#define RCC_CCIPR2_I2C5SEL                  (0x3U<<24U)
#define RCC_CCIPR2_I2C5SEL_0                (0x1U<<24U)
#define RCC_CCIPR2_HSPI1SEL                 (0x3U<<22U)
#define RCC_CCIPR2_HSPI1SEL_0               (0x1U<<22U)
#define RCC_CCIPR2_OCTOSPISEL               (0x3U<<20U)
#define RCC_CCIPR2_OCTOSPISEL_0             (0x1U<<20U)
#define RCC_CCIPR2_LTDCSEL                  (0x1U<<18U)
#define RCC_CCIPR2_USART6SEL                (0x3U<<16U)
#define RCC_CCIPR2_USART6SEL_0              (0x1U<<16U)
#define RCC_CCIPR2_DSISEL                   (0x1U<<15U)
#define RCC_CCIPR2_SDMMCSEL                 (0x1U<<14U)
#define RCC_CCIPR2_RNGSEL                   (0x3U<<12U)
#define RCC_CCIPR2_RNGSEL_0                 (0x1U<<12U)
#define RCC_CCIPR2_SAESSEL                  (0x1U<<11U)
#define RCC_CCIPR2_SAI2SEL                  (0x7U<<8U)
#define RCC_CCIPR2_SAI2SEL_0                (0x1U<<8U)
#define RCC_CCIPR2_SAI1SEL                  (0x7U<<5U)
#define RCC_CCIPR2_SAI1SEL_0                (0x1U<<5U)
#define RCC_CCIPR2_MDF1SEL                  (0x7U<<0U)
#define RCC_CCIPR2_MDF1SEL_0                (0x1U<<0U)
#define RCC_CCIPR2_OTGHSSEL_B_0X0           (0x0U<<30U)
#define RCC_CCIPR2_OTGHSSEL_B_0X1           (0x1U<<30U)
#define RCC_CCIPR2_OTGHSSEL_B_0X2           (0x2U<<30U)
#define RCC_CCIPR2_OTGHSSEL_B_0X3           (0x3U<<30U)
#define RCC_CCIPR2_I2C6SEL_B_0X0            (0x0U<<26U)
#define RCC_CCIPR2_I2C6SEL_B_0X1            (0x1U<<26U)
#define RCC_CCIPR2_I2C6SEL_B_0X2            (0x2U<<26U)
#define RCC_CCIPR2_I2C6SEL_B_0X3            (0x3U<<26U)
#define RCC_CCIPR2_I2C5SEL_B_0X0            (0x0U<<24U)
#define RCC_CCIPR2_I2C5SEL_B_0X1            (0x1U<<24U)
#define RCC_CCIPR2_I2C5SEL_B_0X2            (0x2U<<24U)
#define RCC_CCIPR2_I2C5SEL_B_0X3            (0x3U<<24U)
#define RCC_CCIPR2_HSPI1SEL_B_0X0           (0x0U<<22U)
#define RCC_CCIPR2_HSPI1SEL_B_0X1           (0x1U<<22U)
#define RCC_CCIPR2_HSPI1SEL_B_0X2           (0x2U<<22U)
#define RCC_CCIPR2_HSPI1SEL_B_0X3           (0x3U<<22U)
#define RCC_CCIPR2_OCTOSPISEL_B_0X0         (0x0U<<20U)
#define RCC_CCIPR2_OCTOSPISEL_B_0X1         (0x1U<<20U)
#define RCC_CCIPR2_OCTOSPISEL_B_0X2         (0x2U<<20U)
#define RCC_CCIPR2_OCTOSPISEL_B_0X3         (0x3U<<20U)
#define RCC_CCIPR2_LTDCSEL_B_0X0            (0x0U<<18U)
#define RCC_CCIPR2_LTDCSEL_B_0X1            (0x1U<<18U)
#define RCC_CCIPR2_USART6SEL_B_0X0          (0x0U<<16U)
#define RCC_CCIPR2_USART6SEL_B_0X1          (0x1U<<16U)
#define RCC_CCIPR2_USART6SEL_B_0X2          (0x2U<<16U)
#define RCC_CCIPR2_USART6SEL_B_0X3          (0x3U<<16U)
#define RCC_CCIPR2_DSISEL_B_0X0             (0x0U<<15U)
#define RCC_CCIPR2_DSISEL_B_0X1             (0x1U<<15U)
#define RCC_CCIPR2_SDMMCSEL_B_0X0           (0x0U<<14U)
#define RCC_CCIPR2_SDMMCSEL_B_0X1           (0x1U<<14U)
#define RCC_CCIPR2_RNGSEL_B_0X0             (0x0U<<12U)
#define RCC_CCIPR2_RNGSEL_B_0X1             (0x1U<<12U)
#define RCC_CCIPR2_RNGSEL_B_0X2             (0x2U<<12U)
#define RCC_CCIPR2_RNGSEL_B_0X3             (0x3U<<12U)
#define RCC_CCIPR2_SAESSEL_B_0X0            (0x0U<<11U)
#define RCC_CCIPR2_SAESSEL_B_0X1            (0x1U<<11U)
#define RCC_CCIPR2_SAI2SEL_B_0X0            (0x0U<<8U)
#define RCC_CCIPR2_SAI2SEL_B_0X1            (0x1U<<8U)
#define RCC_CCIPR2_SAI2SEL_B_0X2            (0x2U<<8U)
#define RCC_CCIPR2_SAI2SEL_B_0X3            (0x3U<<8U)
#define RCC_CCIPR2_SAI2SEL_B_0X4            (0x4U<<8U)
#define RCC_CCIPR2_SAI1SEL_B_0X0            (0x0U<<5U)
#define RCC_CCIPR2_SAI1SEL_B_0X1            (0x1U<<5U)
#define RCC_CCIPR2_SAI1SEL_B_0X2            (0x2U<<5U)
#define RCC_CCIPR2_SAI1SEL_B_0X3            (0x3U<<5U)
#define RCC_CCIPR2_SAI1SEL_B_0X4            (0x4U<<5U)
#define RCC_CCIPR2_MDF1SEL_B_0X0            (0x0U<<0U)
#define RCC_CCIPR2_MDF1SEL_B_0X1            (0x1U<<0U)
#define RCC_CCIPR2_MDF1SEL_B_0X2            (0x2U<<0U)
#define RCC_CCIPR2_MDF1SEL_B_0X3            (0x3U<<0U)
#define RCC_CCIPR2_MDF1SEL_B_0X4            (0x4U<<0U)

// CCIPR3 Configuration

#define RCC_CCIPR3_ADF1SEL                  (0x7U<<16U)
#define RCC_CCIPR3_ADF1SEL_0                (0x1U<<16U)
#define RCC_CCIPR3_DAC1SEL                  (0x1U<<15U)
#define RCC_CCIPR3_ADCDACSEL                (0x7U<<12U)
#define RCC_CCIPR3_ADCDACSEL_0              (0x1U<<12U)
#define RCC_CCIPR3_LPTIM1SEL                (0x3U<<10U)
#define RCC_CCIPR3_LPTIM1SEL_0              (0x1U<<10U)
#define RCC_CCIPR3_LPTIM34SEL               (0x3U<<8U)
#define RCC_CCIPR3_LPTIM34SEL_0             (0x1U<<8U)
#define RCC_CCIPR3_I2C3SEL                  (0x3U<<6U)
#define RCC_CCIPR3_I2C3SEL_0                (0x1U<<6U)
#define RCC_CCIPR3_SPI3SEL                  (0x3U<<3U)
#define RCC_CCIPR3_SPI3SEL_0                (0x1U<<3U)
#define RCC_CCIPR3_LPUART1SEL               (0x7U<<0U)
#define RCC_CCIPR3_LPUART1SEL_0             (0x1U<<0U)
#define RCC_CCIPR3_ADF1SEL_B_0X0            (0x0U<<16U)
#define RCC_CCIPR3_ADF1SEL_B_0X1            (0x1U<<16U)
#define RCC_CCIPR3_ADF1SEL_B_0X2            (0x2U<<16U)
#define RCC_CCIPR3_ADF1SEL_B_0X3            (0x3U<<16U)
#define RCC_CCIPR3_ADF1SEL_B_0X4            (0x4U<<16U)
#define RCC_CCIPR3_DAC1SEL_B_0X0            (0x0U<<15U)
#define RCC_CCIPR3_DAC1SEL_B_0X1            (0x1U<<15U)
#define RCC_CCIPR3_ADCDACSEL_B_0X0          (0x0U<<12U)
#define RCC_CCIPR3_ADCDACSEL_B_0X1          (0x1U<<12U)
#define RCC_CCIPR3_ADCDACSEL_B_0X2          (0x2U<<12U)
#define RCC_CCIPR3_ADCDACSEL_B_0X3          (0x3U<<12U)
#define RCC_CCIPR3_ADCDACSEL_B_0X4          (0x4U<<12U)
#define RCC_CCIPR3_ADCDACSEL_B_0X5          (0x5U<<12U)
#define RCC_CCIPR3_LPTIM1SEL_B_0X0          (0x0U<<10U)
#define RCC_CCIPR3_LPTIM1SEL_B_0X1          (0x1U<<10U)
#define RCC_CCIPR3_LPTIM1SEL_B_0X2          (0x2U<<10U)
#define RCC_CCIPR3_LPTIM1SEL_B_0X3          (0x3U<<10U)
#define RCC_CCIPR3_LPTIM34SEL_B_0X0         (0x0U<<8U)
#define RCC_CCIPR3_LPTIM34SEL_B_0X1         (0x1U<<8U)
#define RCC_CCIPR3_LPTIM34SEL_B_0X2         (0x2U<<8U)
#define RCC_CCIPR3_LPTIM34SEL_B_0X3         (0x3U<<8U)
#define RCC_CCIPR3_I2C3SEL_B_0X0            (0x0U<<6U)
#define RCC_CCIPR3_I2C3SEL_B_0X1            (0x1U<<6U)
#define RCC_CCIPR3_I2C3SEL_B_0X2            (0x2U<<6U)
#define RCC_CCIPR3_I2C3SEL_B_0X3            (0x3U<<6U)
#define RCC_CCIPR3_SPI3SEL_B_0X0            (0x0U<<3U)
#define RCC_CCIPR3_SPI3SEL_B_0X1            (0x1U<<3U)
#define RCC_CCIPR3_SPI3SEL_B_0X2            (0x2U<<3U)
#define RCC_CCIPR3_SPI3SEL_B_0X3            (0x3U<<3U)
#define RCC_CCIPR3_LPUART1SEL_B_0X0         (0x0U<<0U)
#define RCC_CCIPR3_LPUART1SEL_B_0X1         (0x1U<<0U)
#define RCC_CCIPR3_LPUART1SEL_B_0X2         (0x2U<<0U)
#define RCC_CCIPR3_LPUART1SEL_B_0X3         (0x3U<<0U)
#define RCC_CCIPR3_LPUART1SEL_B_0X4         (0x4U<<0U)

