Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_rcc.h
// BDCR Configuration

#define RCC_BDCR_LSIPREDIV                  (0x1U<<28U)
#define RCC_BDCR_LSIRDY                     (0x1U<<27U)
#define RCC_BDCR_LSION                      (0x1U<<26U)
#define RCC_BDCR_LSCOSEL                    (0x1U<<25U)
#define RCC_BDCR_LSCOEN                     (0x1U<<24U)
#define RCC_BDCR_BDRST                      (0x1U<<16U)
#define RCC_BDCR_RTCEN                      (0x1U<<15U)
#define RCC_BDCR_LSEGFON                    (0x1U<<12U)
#define RCC_BDCR_LSESYSRDY                  (0x1U<<11U)
#define RCC_BDCR_RTCSEL                     (0x3U<<8U)
#define RCC_BDCR_RTCSEL_0                   (0x1U<<8U)
#define RCC_BDCR_LSESYSEN                   (0x1U<<7U)
#define RCC_BDCR_LSECSSD                    (0x1U<<6U)
#define RCC_BDCR_LSECSSON                   (0x1U<<5U)
#define RCC_BDCR_LSEDRV                     (0x3U<<3U)
#define RCC_BDCR_LSEDRV_0                   (0x1U<<3U)
#define RCC_BDCR_LSEBYP                     (0x1U<<2U)
#define RCC_BDCR_LSERDY                     (0x1U<<1U)
#define RCC_BDCR_LSEON                      (0x1U<<0U)
#define RCC_BDCR_LSIPREDIV_B_0X0            (0x0U<<28U)
#define RCC_BDCR_LSIPREDIV_B_0X1            (0x1U<<28U)
#define RCC_BDCR_LSIRDY_B_0X0               (0x0U<<27U)
#define RCC_BDCR_LSIRDY_B_0X1               (0x1U<<27U)
#define RCC_BDCR_LSION_B_0X0                (0x0U<<26U)
#define RCC_BDCR_LSION_B_0X1                (0x1U<<26U)
#define RCC_BDCR_LSCOSEL_B_0X0              (0x0U<<25U)
#define RCC_BDCR_LSCOSEL_B_0X1              (0x1U<<25U)
#define RCC_BDCR_LSCOEN_B_0X0               (0x0U<<24U)
#define RCC_BDCR_LSCOEN_B_0X1               (0x1U<<24U)
#define RCC_BDCR_BDRST_B_0X0                (0x0U<<16U)
#define RCC_BDCR_BDRST_B_0X1                (0x1U<<16U)
#define RCC_BDCR_RTCEN_B_0X0                (0x0U<<15U)
#define RCC_BDCR_RTCEN_B_0X1                (0x1U<<15U)
#define RCC_BDCR_LSEGFON_B_0X0              (0x0U<<12U)
#define RCC_BDCR_LSEGFON_B_0X1              (0x1U<<12U)
#define RCC_BDCR_LSESYSRDY_B_0X0            (0x0U<<11U)
#define RCC_BDCR_LSESYSRDY_B_0X1            (0x1U<<11U)
#define RCC_BDCR_RTCSEL_B_0X0               (0x0U<<8U)
#define RCC_BDCR_RTCSEL_B_0X1               (0x1U<<8U)
#define RCC_BDCR_RTCSEL_B_0X2               (0x2U<<8U)
#define RCC_BDCR_RTCSEL_B_0X3               (0x3U<<8U)
#define RCC_BDCR_LSESYSEN_B_0X0             (0x0U<<7U)
#define RCC_BDCR_LSESYSEN_B_0X1             (0x1U<<7U)
#define RCC_BDCR_LSECSSD_B_0X0              (0x0U<<6U)
#define RCC_BDCR_LSECSSD_B_0X1              (0x1U<<6U)
#define RCC_BDCR_LSECSSON_B_0X0             (0x0U<<5U)
#define RCC_BDCR_LSECSSON_B_0X1             (0x1U<<5U)
#define RCC_BDCR_LSEDRV_B_0X0               (0x0U<<3U)
#define RCC_BDCR_LSEDRV_B_0X1               (0x1U<<3U)
#define RCC_BDCR_LSEDRV_B_0X2               (0x2U<<3U)
#define RCC_BDCR_LSEDRV_B_0X3               (0x3U<<3U)
#define RCC_BDCR_LSEBYP_B_0X0               (0x0U<<2U)
#define RCC_BDCR_LSEBYP_B_0X1               (0x1U<<2U)
#define RCC_BDCR_LSERDY_B_0X0               (0x0U<<1U)
#define RCC_BDCR_LSERDY_B_0X1               (0x1U<<1U)
#define RCC_BDCR_LSEON_B_0X0                (0x0U<<0U)
#define RCC_BDCR_LSEON_B_0X1                (0x1U<<0U)

// CSR Configuration

#define RCC_CSR_LPWRRSTF                    (0x1U<<31U)
#define RCC_CSR_WWDGRSTF                    (0x1U<<30U)
#define RCC_CSR_IWDGRSTF                    (0x1U<<29U)
#define RCC_CSR_SFTRSTF                     (0x1U<<28U)
#define RCC_CSR_BORRSTF                     (0x1U<<27U)
#define RCC_CSR_PINRSTF                     (0x1U<<26U)
#define RCC_CSR_OBLRSTF                     (0x1U<<25U)
#define RCC_CSR_RMVF                        (0x1U<<23U)
#define RCC_CSR_MSISSRANGE                  (0xFU<<12U)
#define RCC_CSR_MSISSRANGE_0                (0x1U<<12U)
#define RCC_CSR_MSIKSRANGE                  (0xFU<<8U)
#define RCC_CSR_MSIKSRANGE_0                (0x1U<<8U)
#define RCC_CSR_LPWRRSTF_B_0X0              (0x0U<<31U)
#define RCC_CSR_LPWRRSTF_B_0X1              (0x1U<<31U)
#define RCC_CSR_WWDGRSTF_B_0X0              (0x0U<<30U)
#define RCC_CSR_WWDGRSTF_B_0X1              (0x1U<<30U)
#define RCC_CSR_IWDGRSTF_B_0X0              (0x0U<<29U)
#define RCC_CSR_IWDGRSTF_B_0X1              (0x1U<<29U)
#define RCC_CSR_SFTRSTF_B_0X0               (0x0U<<28U)
#define RCC_CSR_SFTRSTF_B_0X1               (0x1U<<28U)
#define RCC_CSR_BORRSTF_B_0X0               (0x0U<<27U)
#define RCC_CSR_BORRSTF_B_0X1               (0x1U<<27U)
#define RCC_CSR_PINRSTF_B_0X0               (0x0U<<26U)
#define RCC_CSR_PINRSTF_B_0X1               (0x1U<<26U)
#define RCC_CSR_OBLRSTF_B_0X0               (0x0U<<25U)
#define RCC_CSR_OBLRSTF_B_0X1               (0x1U<<25U)
#define RCC_CSR_RMVF_B_0X0                  (0x0U<<23U)
#define RCC_CSR_RMVF_B_0X1                  (0x1U<<23U)
#define RCC_CSR_MSISSRANGE_B_0X4            (0x4U<<12U)
#define RCC_CSR_MSISSRANGE_B_0X5            (0x5U<<12U)
#define RCC_CSR_MSISSRANGE_B_0X6            (0x6U<<12U)
#define RCC_CSR_MSISSRANGE_B_0X7            (0x7U<<12U)
#define RCC_CSR_MSISSRANGE_B_0X8            (0x8U<<12U)
#define RCC_CSR_MSIKSRANGE_B_0X4            (0x4U<<8U)
#define RCC_CSR_MSIKSRANGE_B_0X5            (0x5U<<8U)
#define RCC_CSR_MSIKSRANGE_B_0X6            (0x6U<<8U)
#define RCC_CSR_MSIKSRANGE_B_0X7            (0x7U<<8U)
#define RCC_CSR_MSIKSRANGE_B_0X8            (0x8U<<8U)

// SECCFGR Configuration

#define RCC_SECCFGR_RMVFSEC                 (0x1U<<12U)
#define RCC_SECCFGR_HSI48SEC                (0x1U<<11U)
#define RCC_SECCFGR_ICLKSEC                 (0x1U<<10U)
#define RCC_SECCFGR_PLL3SEC                 (0x1U<<9U)
#define RCC_SECCFGR_PLL2SEC                 (0x1U<<8U)
#define RCC_SECCFGR_PLL1SEC                 (0x1U<<7U)
#define RCC_SECCFGR_PRESCSEC                (0x1U<<6U)
#define RCC_SECCFGR_SYSCLKSEC               (0x1U<<5U)
#define RCC_SECCFGR_LSESEC                  (0x1U<<4U)
#define RCC_SECCFGR_LSISEC                  (0x1U<<3U)
#define RCC_SECCFGR_MSISEC                  (0x1U<<2U)
#define RCC_SECCFGR_HSESEC                  (0x1U<<1U)
#define RCC_SECCFGR_HSISEC                  (0x1U<<0U)
#define RCC_SECCFGR_RMVFSEC_B_0X0           (0x0U<<12U)
#define RCC_SECCFGR_RMVFSEC_B_0X1           (0x1U<<12U)
#define RCC_SECCFGR_HSI48SEC_B_0X0          (0x0U<<11U)
#define RCC_SECCFGR_HSI48SEC_B_0X1          (0x1U<<11U)
#define RCC_SECCFGR_ICLKSEC_B_0X0           (0x0U<<10U)
#define RCC_SECCFGR_ICLKSEC_B_0X1           (0x1U<<10U)
#define RCC_SECCFGR_PLL3SEC_B_0X0           (0x0U<<9U)
#define RCC_SECCFGR_PLL3SEC_B_0X1           (0x1U<<9U)
#define RCC_SECCFGR_PLL2SEC_B_0X0           (0x0U<<8U)
#define RCC_SECCFGR_PLL2SEC_B_0X1           (0x1U<<8U)
#define RCC_SECCFGR_PLL1SEC_B_0X0           (0x0U<<7U)
#define RCC_SECCFGR_PLL1SEC_B_0X1           (0x1U<<7U)
#define RCC_SECCFGR_PRESCSEC_B_0X0          (0x0U<<6U)
#define RCC_SECCFGR_PRESCSEC_B_0X1          (0x1U<<6U)
#define RCC_SECCFGR_SYSCLKSEC_B_0X0         (0x0U<<5U)
#define RCC_SECCFGR_SYSCLKSEC_B_0X1         (0x1U<<5U)
#define RCC_SECCFGR_LSESEC_B_0X0            (0x0U<<4U)
#define RCC_SECCFGR_LSESEC_B_0X1            (0x1U<<4U)
#define RCC_SECCFGR_LSISEC_B_0X0            (0x0U<<3U)
#define RCC_SECCFGR_LSISEC_B_0X1            (0x1U<<3U)
#define RCC_SECCFGR_MSISEC_B_0X0            (0x0U<<2U)
#define RCC_SECCFGR_MSISEC_B_0X1            (0x1U<<2U)
#define RCC_SECCFGR_HSESEC_B_0X0            (0x0U<<1U)
#define RCC_SECCFGR_HSESEC_B_0X1            (0x1U<<1U)
#define RCC_SECCFGR_HSISEC_B_0X0            (0x0U<<0U)
#define RCC_SECCFGR_HSISEC_B_0X1            (0x1U<<0U)

// PRIVCFGR Configuration

#define RCC_PRIVCFGR_NSPRIV                 (0x1U<<1U)
#define RCC_PRIVCFGR_SPRIV                  (0x1U<<0U)
#define RCC_PRIVCFGR_NSPRIV_B_0X0           (0x0U<<1U)
#define RCC_PRIVCFGR_NSPRIV_B_0X1           (0x1U<<1U)
#define RCC_PRIVCFGR_SPRIV_B_0X0            (0x0U<<0U)
#define RCC_PRIVCFGR_SPRIV_B_0X1            (0x1U<<0U)
